[
    {
        "strategy_name": "AccumulationDistributionStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/AccumulationDistributionStrat",
        "description": "Description Accumulation/Disribution is a strategy created by Domenico D'Errico in attempt to identify and utilize market phases stipulated by Dow theory. The strategy recognizes accumulation and distribution market phases based on range or average true range compression and adds simulated buy and sell orders accordingly. The strategy recognizes the accumulation market phase if the price is in downtrend, but the price move is slowing down while gaining short-term momentum. Conversely, the distribution phase is recognized if the price is in uptrend while losing short-term momentum and the overall price move shows signs of slowing down. The slowing down of the price move, or range compression, is evaluated by the Accumulation/Distribution study. Two types of range measurement can be used with this study: high-low range or average true range. A simulated buy to open order is added if all of the following conditions are fulfilled: Range compression is detected. A higher 12-week low is registered. The close price breaks above a recent highest level. Average volume has recently increased. Two past average values are compared: a recent average value and a value that is offset from it by the average length. A simulated sell to close order is added when the close price falls below a recent low. Input Parameters Parameter Description length Defines the period for which the high-low range or the average true range is calculated. factor Defines the upper limit (exclusive) of the recent to past range ratio for the range compression to be recognized. vol ratio Defines the lower limit (exclusive) of the recent to past average volume ratio for the volume condition to be fulfilled. vol avg length Defines the length of the moving average calculated for volume. vol delay Defines the offset from the current bar to find the recent value of the average volume. mode Defines whether to use the high-low range or the average true range in the calculations. Further Reading 1. \"Portfolio Strategy Based On Accumulation/Distribution\" by Domenico D'Errico. Technical Analysis of Stocks & Commodities, August 2018. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "AdvanceDeclineCumulative",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/AdvanceDeclineCumulative",
        "description": "Description The Advance/Decline Cumulative Average strategy is based upon the eponymous technical indicator which calculates cumulative sum of the advance-decline value and compares it with its SMA. The Buy order is added when study's CumulAD plot is higher than the average; Sell order when it is lower. Input Parameters Parameter Description exchange Defines the market providing the advance/decline data. length The number of bars used in calculation of the SMA. Further Reading 1. \"Low-Frequency Trading\" by Ron McEwan. Technical Analysis of Stocks & Commodities, April 2013. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ADXTrend",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/ADXTrend",
        "description": "Description The ADXTrend strategy is based on the trend-following indicator Average Directional Index (ADX) . Values of this indicator are interpreted by the strategy as follows: ADX values being greater than both a lower threshold ( crit level in the input parameters) and its own lowest value times a multiplier are read as indication of trend development; ADX values being greater than a higher threshold level ( trend level in the input parameters ) but lower than the maximum level are interpreted as strong trending conditions; If either of these conditions is true and close price rises above its own moving average, a simulated buy-to-open order is added. In the same conditions, a simulated sell-to-open order is added should the close price fall below the average. Simulated exit orders are added based on crossovers of the close price plot with its moving average: when the close price crosses below the average, a simulated sell-to-close order is added; when it crosses above - the simulation of buy-to-close takes place. Input Parameters length Defines the period for the calculation of the Average Directional Index (ADX). lag Defines the period upon which the lowest ADX value is to be found (used in checking for trend development). average length Defines the period for the calculation of the moving average. trend level Defines the minimum ADX level at which strong trending conditions are recognized. max level Defines the maximum ADX level at which strong trending conditions are recognized. crit level Defines the minimum ADX level at which trend development is recognized. mult Defines the multiplier used in checking for trend development. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Further Reading 1. \"Which Trend Indicator Wins?\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, October 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ADXBreakoutsLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/ADXBreakoutsLE",
        "description": "Description The ADXBreakoutsLE is a long entry strategy developed by Ken Calhoun. As it is discussed in his article “ADX Breakouts”, this strategy is to be applied to stock symbols that satisfy certain price range criteria; to find these symbols, use the ADXBreakoutsFilter study . Based on Average Directional Index (ADX) , the strategy helps spot and utilize high-volatility price breakouts. The main idea of using ADX in this indicator is a popular suggestion that high ADX values signify high levels of volatility. Values greater than 40 are perceived as a signal for strong breakout price action. Thus, the primary triggering condition is ADX crossing the level of 40, with price being at its 15-day highest (a customizable default value). If such an event occurs, the strategy records the high price and adds a simulated long entry order as soon as price exceeds this value by a certain amount. This amount is set by default to 50 cents. Since the strategy is long entry only, you might want to use other strategies for exits, e.g., TrailingStopLX . Input Parameters highest length Defines the period upon which the highest price is determined. adx length Defines the period for ADX calculation. adx level Defines the threshold ADX value for the strategy to trigger a signal. offset Defines the minimum amount by which the price should exceed its recorded highest value. Further Reading 1. \"ADX Breakouts\" by Ken Calhoun. Technical Analysis of Stocks & Commodities, March 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ATRHighSMABreakoutsLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/ATRHighSMABreakoutsLE",
        "description": "Description The ATRHighSMABreakoutsLE is a long entry strategy developed by Ken Calhoun. As it is discussed in his article “ATR Breakout Entries,” this strategy is to be applied to stock symbols that satisfy certain price range and volume criteria; to find these symbols, use the ATRHighSMABreakoutsFilter study in the Stock Hacker. Akin to Mr. Calhoun’s previous installment, ADXBreakouts , this strategy explores high-volatility price breakouts in order to produce important long entry signals. In ATRHighSMABreakouts, breakout calculations are based on two popular technical indicators: the Average True Range (ATR) and a simple moving average (SMA) of the close price. The rationale of ATR employment here is the observation that its values increase as the daily high-low ranges expand. For a buy signal, this will need to be confirmed by a moving average crossover. The primary triggering condition for the long entry signal is ATR being at its 14-day highest and price being above its 100-day SMA (both numbers are customizable via input parameters). If this condition is fulfilled, the strategy records the high price and adds a simulated long entry order as soon as price exceeds this value by a certain amount. This amount is set by default to 50 cents. There are also two extra conditions which may be applied in order to refine the signals: a wide-range candle and volume increase (both turned off by default). Turning on the wide-range candle filter will have the strategy add a simulated order only if the height of the candle at which the primary condition has triggered is at least 1.5 times greater than the average. Turning on the volume filter will add checking if the volume has increased since the last candle. Since the strategy is long entry only, you might want to use other strategies for exits, e.g., TrailingStopLX . Input Parameters length Defines the period for ATR calculation. average length Defines the period for SMA calculation. offset Defines the minimum amount by which the price should exceed its recorded highest value. wide range candle Defines whether the condition should only trigger at a candle whose height is at least 1.5 times greater than the average. volume increase Defines whether the condition should only trigger if the volume has increased since the last candle. Further Reading 1. \"ATR Breakout Entries\" by Ken Calhoun. Technical Analysis of Stocks & Commodities, May 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ATRTrailingStopLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/ATRTrailingStopLE",
        "description": "Description The ATRTrailingStopLE strategy generates a Long Entry signal when the close price rises above the ATR Trailing Stop value. Input Parameters Parameter Description trail type Defines whether to use \"modified\" or \"unmodified\" trailing stop calculation mechanism. atr period The number of bars used to calculate the Average True Range. atr factor The multiplier of the ATR value. first trade Defines whether to initialize ATR calculation at a short or a long position. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ATRTrailingStopSE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/ATRTrailingStopSE",
        "description": "Description The ATRTrailingStopSE strategy generates a Short Entry signal when the close price falls below the ATR Trailing Stop value. Input Parameters Parameter Description trail type Defines whether to use \"modified\" or \"unmodified\" trailing stop calculation mechanism. atr period The number of bars used to calculate the Average True Range. atr factor The multiplier of the ATR value. first trade Defines whether to initialize ATR calculation at a short or a long position. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "BBDivergenceStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/BBDivergenceStrat",
        "description": "Description The BBDivergence strategy is a trading system developed by Markos Katsanos and described in his article “Trading the Loonie”. The main idea behind this system is to act upon temporary divergences in otherwise highly correlated markets. The divergence is measured by the BBDivergence study , a Bollinger Bands based technical indicator. Being a trading system, the BBDivergence strategy uses a combination of well-known indicators and produces simulated orders of all four types: Buy to open, Sell to close, Sell Short, and Buy to cover. A Buy to open simulated order is added if all of the following conditions are true: The 3-day maximum divergence is above 20, but is currently falling; Both primary close price and secondary close average have been trending up during last 2 days; The correlation between the primary and the secondary close prices is above -0.4. A Sell to close simulated order is added if any of the following is true: The MACD crosses below its own 9-day EMA and the Stochastic is above 85; The 3-day minimum divergence is below -20 and the rate of change is below -3; The primary trade closes at the lowest level for the last 15 days, while the correlation is below -0.4. A Sell short simulated order is added if all of the following conditions are true: The 3-day minimum divergence is below -20, but is currently rising; Both primary close price and secondary close average have been in downtrend during last 2 days; The correlation between the primary and the secondary close prices is above 0.4. A Buy to cover order is added if any of the following is true: The MACD crosses below its own 9-day EMA, the Stochastic is below 85, and the secondary close is by at least 4% greater than the 15-day low; The 3-day maximum divergence is above 20 and the rate of change is above 4.5; The primary trade closes at the highest level for the last 15 days, while the correlation is below -0.4. Input Parameters secondary symbol Defines the secondary security for divergence calculation. length The length used in Bollinger Bands calculation. Further Reading 1. \"Trading The Loonie\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, December 2015. Bollinger Bands is a registered trademark of John Bollinger. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "BollingerBandsLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/BollingerBandsLE",
        "description": "Description The Bollinger Bands Long Entry strategy generates a Long Entry signal when the price crosses above the lower band. Lower band's values are calculated by subtracting a specified number of standard deviations over a time period from the price's SMA. Input Parameters Parameter Description length The number of bars to calculate the standard deviation. num devs dn The number of standard deviations to subtract from the price's SMA. bollinger price The price used to calculate the Bollinger Bands study. lower band price The price to look for crossovers with. Bollinger Bands is a registered trademark of John Bollinger. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "BollingerBandsSE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/BollingerBandsSE",
        "description": "Description The Bollinger Bands Short Entry strategy generates a Short Entry signal when the price crosses below the upper band. Upper band's values are calculated by adding a specified number of standard deviations over a time period to the price's SMA. Input Parameters Parameter Description length The number of bars to calculate the standard deviation. num devs up The number of standard deviations to add to the price's SMA. bollinger price The price used to calculate the Bollinger Bands study. upper band price The price to look for crossovers with. Bollinger Bands is a registered trademark of John Bollinger. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "BollingerBandsWithEngulfing",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/BollingerBandsWithEngulfing",
        "description": "Bollinger Bands with Engulfing is a strategy developed by Pawel Kosinski. It includes: finding an occurrence of the bullish Engulfing candlestick pattern within Bollinger Bands controlling the risk-reward ratio setting up a stop-loss for automatic exits A buy to open simulated order is added when both of the following events happen at the same time: An Engulfing pattern closes above the lower of the Bollinger Bands. The risk-reward ratio is above the minimum value (1.0 by default). Calculated as the ratio of the distance between the high price and the upper Bollinger band to the distance between the high price and the stop price. A sell to close simulated order is added when either of the following conditions is true: High price pierces the upper Bollinger band. Low price falls below the stop price. Stop price is equal to the current close less ATR multiplied by the specified factor. Input Parameters Parameter Description length The length for which Bollinger Bands are to be calculated. num dev Half-distance between the upper and the lower band. Measured in standard deviations of the close price. atr factor The factor by which ATR is to be multiplied when calculating the stop price. reward risk ratio The minimum value of the risk-reward ratio for the simulated buy signal to be added. Plots Plot Description UpperBand The upper Bollinger band. LowerBand The lower Bollinger band. BullishEngulfing Bullish Engulfing pattern. StopLoss The stop-loss plot. Further Reading 1. \"Combining Bollinger Bands With Candlesticks\" by Pawel Kosinski. Technical Analysis of Stocks & Commodities, October 2019. Bollinger Bands is a registered trademark of John Bollinger. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "CamarillaPointsStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/CamarillaPointsStrat",
        "description": "Description The Camarilla Points strategy is based upon support and resistance levels calculated by the eponymous technical indicator . When market opens within the S3-R3 range, it is supposed a premise for possible trend reversal, so Long Entry signal is given if market closes below S3; Short Entry signal if it closes above R3. Market opening outside the S3-R3 range might signify that trend will keep its direction; in this case, Long Entry signal is indicated when the market closes above S3 and Short Entry signal when it closes below R3. Exit signals are indicated based upon the stop-loss levels S4 and R4 (in addition to the mentioned S3 and R3). Long Exit signal is given when either Low price falls below S4 or High price gets above R3. Short Exit signal is suggested when either High price rises above R4 or Low price is below S3. Input Parameters Parameter Description aggregation period Defines aggregation period for Camarilla Points time frame. length Defines duration for Camarilla Points time frame. Further Reading 1. \"Camarilla Points\" by Slawomir Bobrowski. Technical Analysis of Stocks & Commodities, March 2013. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ConsBarsDownSE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/ConsBarsDownSE",
        "description": "Description The ConsBarsDownSE strategy generates a short entry signal when a decreasing price sequence is found. By default, a sell to open simulated order is added after a sequence of four bars, each closing below the previous one. The length of the sequence and the price type can be customized in the input parameters. To mirror the conditions for the long entry signals, use ConsBarsUpLE . Note: Using the strategy on a Renko Bars chart may generate more signals. Input Parameters Parameter Description consecutive bars down The number of bars in the sequence to generate the signal. price The price analyzed for decreasing sequences. Further reading 1. \"Using Renko Charts\" by John Devcic. Technical Analysis of Stocks & Commodities, December 2019. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ConsBarsUpLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/ConsBarsUpLE",
        "description": "Description The ConsBarsUpLE strategy generates a long entry signal when an increasing price sequence is found. By default, a buy to open simulated order is added after a sequence of four bars, each closing above the previous one. The length of the sequence and the price type can be customized in the input parameters. To mirror the conditions for the short entry signals, use ConsBarsDownSE . Note: Using the strategy on a Renko Bars chart may generate more signals. Input Parameters Parameter Description consecutive bars up The number of bars in the sequence to generate the signal. price The price analyzed for increasing sequences. Further reading 1. \"Using Renko Charts\" by John Devcic. Technical Analysis of Stocks & Commodities, December 2019. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "Donchian",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/A-D/Donchian",
        "description": "Description The Donchian strategy is a technical indicator based on the Donchian channel, allowing for several levels of complexity. The current implementation and default values of this channel are presented by Oscar G. Cagigas in his article \"The Degree of Complexity\". In order to build the Donchian channel, the system registers the highest high and the lowest low price on two periods (by default, 40 and 15). The upper band value is equal to the highest high on the shorter period if there is a simulated short position; otherwise, the highest high on the longer period is used. The lower band uses the lowest low on the shorter period if there is a simulated long position; if the position is short or absent, the lowest price on the longer period is plotted instead. At the lowest complexity level, the strategy adds simulated orders according to the following rules: Buy To Open . The high price is greater than the previously calculated highest high on the longer period. Sell To Open . The low price is less than the previously calculated lowest low on the longer period. Buy To Close . The high price is greater than the previously calculated highest high on the shorter period. Sell To Close . The low price is less than the previously calculated lowest low on the shorter period. To increase the complexity of the system to the medium level, you can add either a volatility filter or an ATR -based stop loss. The volatility filter affects simulated entry orders: in addition to the previously described conditions, this filter enables checking whether the previous true range was less than its average value multiplied by a factor. The stop-loss affects simulated exit orders: for Sells, it checks whether the close price is less than the entry price minus the Average True Range (ATR) multiplied by the stop factor. For Buys, it's vice versa: the high price needs to exceed the entry price by the ATR multiplied by the stop factor. In order to set the strategy to the medium level, set either the atr factor or the atr stop factor to a non-zero value. If you prefer to use the highest complexity level, make sure both parameters are non-zero. Input Parameters entry length The longer period, in bars. exit length The shorter period, in bars. atr length The number of bars used in the calculation of the Average True Range. atr factor The factor used in the calculation of the volatility filter. Setting this parameter to zero will reduce the complexity of the system. atr stop factor The factor used in the calculation of the stop loss. Setting this parameter to zero will reduce the complexity of the system. atr average type The type of moving average to be used in the calculation of the Average True Range: simple , exponential , weighted , Wilder's , or Hull . Plots BuyStop The highest high on the longer period; displayed if there is no short position. CoverStop The highest high on the shorter period; displayed if there is a short position. ShortStop The lowest low on the longer period; displayed if there is no long position. SellStop The lowest low on the shorter period; displayed if there is a long position. Further Reading 1. \"The Degree Of Complexity\" by Oscar G. Cagigas. Technical Analysis of Stocks & Commodities, February 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "EhlersStoch",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/EhlersStoch",
        "description": "Description The EhlersStoch strategy is based upon the Ehler's Stochastic study, a Stochastic oscillator with application of the Roofing Filter . The filter and the oscillator are both developed by John F. Ehlers, based on aerospace analog filters. Two modes of analysis are available for this strategy: conventional and predictive. In conventional mode, a simulated Buy order is added when Ehler's Stochastic crosses above the oversold level and a simulated Sell signal is added when it crosses below the overbought level. For the predictive mode, crossover directions are inverse: simulated Buy order is added when the Stochastic plot crosses below the oversold level and simulated Sell signal is shown when it crosses above the overbought level. Input Parameters Parameter Description price The price to which the filter is applied. length The period upon which the highest and the lowest values of the price are found. cutoff length Maximum period for a wave cycle to be considered noise. over bought Defines the overbought level. over sold Defines the oversold level. mode Defines whether the conventional or the predictive mode will be used. Further Reading 1. \"Predictive Indicators for Effective Trading Strategies\" by John F. Ehlers. Technical Analysis of Stocks & Commodities, January 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "EightMonthAvg",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/EightMonthAvg",
        "description": "Description The EightMonthAvg strategy compares monthly price with its average of specified type and length. It adds a BUY_AUTO order at the last bar of the month if the average crosses below the price; SELL_AUTO order if it crosses above. As was proposed by strategy's author Brooke Gardner, it should use an 8 month Simple Moving Average with monthly Close. Input Parameters Parameter Description price The price used in calculation. length The length of the moving average, in months. average type The type of average used in calculations. Further Reading 1. \"Trading High-Yield Bonds Using ETFs\" by Brooke Gardner. Technical Analysis of Stocks & Commodities, June 2012. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ElegantOscillatorStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/ElegantOscillatorStrat",
        "description": "Description The Elegant Oscillator strategy is based on the eponymous technical indicator based on the inverse Fisher transform. The strategy adds simulated buy and sell signals based on the behavior of Elegant Oscillator’s main plot: A simulated buy signal is added when the indicator value falls below the lower threshold while the line is forming a valley. A simulated sell signal is added when the indicator value surpasses the upper threshold while the line is forming a peak. Input Parameters Parameter Description rms length The length used for calculation of the root mean square in the inverse Fisher transform. cutoff length The length used in the calculation of the SuperSmoother filter. threshold The threshold that triggers the simulated sell signal. For simulated buy signals, the negative value is used. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ERTrend",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/ERTrend",
        "description": "Description The ERTrend strategy is based on the trend-following indicator Efficiency Ratio (ER) . Values of this indicator are interpreted by the strategy as follows: ER values being greater than both a lower threshold ( crit level in the input parameters) and its own lowest value times a multiplier are read as indication of trend development; ER values being greater than a higher threshold level ( trend level in the input parameters ) but lower than the maximum level are interpreted as strong trending conditions; If either of these conditions is true and close price rises above its own moving average, a simulated buy-to-open order is added. In the same conditions, a simulated sell-to-open order is added should the close price fall below the average. Simulated exit orders are added based on crossovers of the close price plot with its moving average: when the close price crosses below the average, a simulated sell-to-close order is added; when it crosses above - the simulation of buy-to-close takes place. Input Parameters Parameter Description length Defines the period for the calculation of the Efficiency Ratio (ER). er average length The number of bars used to calculate the ER average. lag Defines the period upon which the lowest ER value is to be found (used in checking for trend development). average length Defines the period for the calculation of the close price moving average. trend level Defines the minimum ER level at which strong trending conditions are recognized. max level Defines the maximum ER level at which strong trending conditions are recognized. crit level Defines the minimum ER level at which trend development is recognized. mult Defines the multiplier used in checking for trend development. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Further Reading 1. \"Which Trend Indicator Wins?\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, October 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "FirstHourBreakout",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/FirstHourBreakout",
        "description": "Description The First-Hour Breakout strategy adds simulated orders based on the price range calculated for the first hour of the regular trading session. By default, it also compares the volume traded last night to the average nightly volume over the last five days (see the article on the Cumulative Overnight Volume for details). In addition to the first-hour range check and the overnight volume check, the strategy performs several checks at specified timestamps during the trading day. Note that since thinkScript uses timestamps in Eastern Standard Time (EST), the default numbers in the input parameters are adjusted accordingly. The simulated orders will be added based on the following algorithm (all timestamps mentioned are default and can be modified using the input parameters): At 9:30 am Eastern Standard Time (EST), the strategy compares the total volume traded last night to the average nightly volume over the last five days. If the overnight volume is greater than the average, the strategy detects a volatility bias and will perform the next step. If the overnight volume is less than or equal to the average, no simulated orders will be added during this day and the check will be repeated at the same time the next day. At 10:30 am EST, the strategy registers the price range of the first hour of the trading day. If the price rises above or falls below this range at any moment from 10:45 am EST to 3:45 pm EST, the strategy will add a simulated order: a buy to open order when the price rises and a sell to open order when it falls. No simulated orders to open will be added after 3:45 pm EST. All open simulated positions will be closed with the opposite simulated orders at 4:15 pm EST. Note that you can turn off the overnight volume check by setting the use filter parameter to no . Input Parameters Parameter Description night session from midnight Defines the start of the midnight trading session in the EST time zone, 24-hour hhmm notation. first hour trading Defines the start of the day trading session in the EST time zone, 24-hour hhmm notation. main session Defines the start of the main session (by default, one hour after the market opens) in the EST time zone 24-hour hhmm notation. no more long positions Defines the end time for adding simulated orders to open in the EST timezone, 24-hour hhmm notation. night session from main session end Defines the end of the main session in the EST time zone, 24-hour hhmm notation. use filter Defines whether or not to use volatility bias as the primary condition for adding simulated orders to open. Further Reading 1. \"Daytrading With Night Volume\" by Domenico D'Errico. Technical Analysis of Stocks & Commodities, June 2017. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "FourDayBreakoutLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/FourDayBreakoutLE",
        "description": "Description The Four-Day Breakout LE strategy is designed by Ken Calhoun. The strategy adds a buy to open order if: 1. Close price is greater than its simple moving average. 2. The last four candles are all bullish. 3. Price rises by at least $0.50 above the high of the highest of these candles. The strategy is thus based on the assumption that when such a pattern appears on the chart, the pressure is on the buyers' side and the trend is likely to continue. Moving average length, the minimum number of candles in the pattern, and the minimum buy stop offset can all be customized in the input parameters. Input Parameters Parameter Description average length The length with which the moving average is to be calculated. pattern length The minimum number of candles in the pattern. breakout amount The minimum price change after the pattern for the strategy to trigger. Further reading 1. \"Swing Trading Four-Day Breakouts\" by Ken Calhoun. Technical Analysis of Stocks & Commodities, October 2017. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "GandalfProjectResearchSystem",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/GandalfProjectResearchSystem",
        "description": "Description GandalfProjectResearchSystem is a trading strategy developed by Domenico D'Errico and Giovanni Trombetta. This strategy uses such data as candle average price (ohlc4) , median price , and mid-body value to spot the points of price weakness to add entry signals. Sell signals are added after a certain time or price condition is met. A simulated buy to open order is added if either all of the following is true: The previous ohlc4 is less than the previous median price. The median price from 2 bars ago is less than or equal to the previous ohlc4. The median price from 2 bars ago is less than or equal to the ohlc4 from 3 bars ago. OR if all of the following is true: The previous ohlc4 is less than the median price from 3 bars ago. The current mid-body price is less than the median price from 2 bars ago. The previous mid-body price is less than the mid-body price from 2 bars ago. A sell to close simulated order is added if any of the following is true: A specified exit number of bars elapses after an entry. A specified gain-exit number of bars elapses after an entry while the close price is greater than the entry price. Close price is less than the entry price and either of the additional conditions is true. An additional condition is either all of the following: The previous ohlc4 is less than the previous mid-body price. The median price from 2 bars ago equals to the mid-body price from 3 bars ago. The previous mid-body price is less than or equal to the mid-body price from 4 bars ago. OR if all of the following: The ohlc4 from 2 bars ago is less than the current mid-body price. The median price from 4 bars ago is less than the ohlc4 from 3 bars ago. The previous mid-body price is less than the previous ohlc4. Input Parameters Parameter Description exit length Defines the general exit time condition. exit gain length Defines the exit time condition if the price grows after the entry. Further Reading 1. \"System Development Using Artificial Intelligence\" by Domenico D'Errico and Giovanni Trombetta, PhD. Technical Analysis of Stocks & Commodities, August 2017. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "GapDownSE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/GapDownSE",
        "description": "Description The GapDownSE strategy generates a Short Entry signal when Gap Down occurs. Gap Down is a combination of bars where the current High is lower than the previous bar's Low. In the event of Gap Down, the Short Entry signal is generated for the next bar. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "GapMomentumSystem",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/GapMomentumSystem",
        "description": "Description The GapMomentumSystem strategy is based on signals provided by the Gap Momentum indicator. The strategy adds signals by comparing the values of the signal line, which is created by averaging the ratio of accumulated gap prices over a specified period. GapMomentumSystem adds simulated orders based on the following conditions: Simulated buy-to-open orders are added when the value of the signal line for the current bar is higher than the value for the previous bar. Simulated sell-to-close orders are added when the value of the signal line for the current bar is lower than the value for the previous bar. Input Parameters Parameter Description length The length of the period used to accumulate gap prices. signal length The length of the average used to calculate the signal line. full range Defines whether the study is initialized using the first bar in the lookup period or the current bar. Further Reading 1. \"Taking A Page From the On-Balance Volume – Gap Momentum\" by Perry J. Kaufman. Technical Analysis of Stocks & Commodities, January 2024. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "GapReversalLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/GapReversalLE",
        "description": "Description The GapReversalLE is a gap-based long-entry strategy developed by Ken Calhoun. As discussed in his article “Trading Gap Reversals”, the strategy is to be applied to 2-day 1-minute charts for stocks priced between $20 and $70. To recognize such stocks, use thinkorswim Stock Hacker. While trading the gaps is a base for many technical indicators, this strategy is about the proportions of such a gap. On certain intraday charts, sufficient gaps might indicate that the stock is currently being overbought or oversold, which may result in a reversal. By default, the GapReversalLE adds a simulated buy order if the price has risen by 50 cents after a gap of 10% or more from the previous day’s low. Both numbers are customizable via input parameters. Since the strategy is long entry only, you might want to use other strategies for exits, e.g., TrailingStopLX . Input Parameters gap Defines the minimum gap (in percent) from the previous day's low. offset Defines the minimum amount by which the price should rise after the gap. Further Reading 1. \"Trading Gap Reversals\" by Ken Calhoun. Technical Analysis of Stocks & Commodities, April 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "GapUpLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/GapUpLE",
        "description": "Description The GapUpLE strategy generates a Long Entry signal when Gap Up occurs. Gap Up is a combination of bars where the current Low is higher than the previous bar's High. In the event of Gap Up, the Long Entry signal is generated for the next bar. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "GoldenCrossBreakouts",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/GoldenCrossBreakouts",
        "description": "Description The Golden Cross Breakouts strategy is a moving average-based technical indicator proposed by Ken Calhoun. Designed for swing trading purposes, it calculates two moving averages of the close price and adds simulated orders based on their crossovers. The name of this strategy refers to the popular \"golden cross\" breakout pattern, an event where a security's shorter moving average crosses above the long-term one. By default, the strategy adds a simulated buy order when the 50-period simple moving average of the close price crosses above the 200-period one. A simulated sell order is added when the price breaks below the 50-period moving average. Alternatively, a trailing stop can be used for exits, e.g., the TrailingStopLX . Note that you can also customize this strategy by changing moving average types and lengths in the input parameters. Input Parameters fast length Defines the length of the fast moving average; it must be less than the slow moving average length. slow length Defines the length of the slow moving average; it must be greater than the fast moving average length. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Plots FastMA The fast moving average plot. SlowMA The slow moving average plot. Further Reading 1. \"Golden Cross Breakouts\" by Ken Calhoun. Technical Analysis of Stocks & Commodities, March 2017. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "GoldenTriangleLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/GoldenTriangleLE",
        "description": "Description The Golden Triangle (Long Entry) strategy is a moving average based technical indicator developed by Charlotte Hudging in attempt to identify promising entries on stock charts. This strategy is an improvement on a popular \"buy on a dip\" practice that suggests making entries after a significant decline in hope that the price would eventually rise. The main principle of the strategy is to look for accelerating stocks that suddenly fall and then return to the initial uptrend. This sudden fall, anticipated to be a part of a bottom formation, defines the suggested entry point. While seeing bottoms appear on charts is quite common, their uptrend sections might be not as satisfying as one can expect. The Golden Triangle strategy is said to help identify stocks that are likely to regain acceleration. The name of this strategy refers to a geometrical figure that forms on chart when pullback and recovery fragments of the price action satisfy certain criteria. The strategy uses the following criteria for the Golden Triangle identification: Initial uptrend. Golden Triangles form after an uptrend, so the strategy initially looks for a stock's price that rises faster than its moving average. By default, the 50 period simple moving average (SMA) is used. Pivot point. This point defines where the price switches to a short-term downtrend. Price drop. After the pivot, price needs to drop below its SMA and maintain this level throughout the price drop. This defines the initial setup of the Golden Triangle. When the mentioned criteria are met, the strategy looks for price and volume confirmation to add a simulated Buy order. The price confirms when after the previously described downfall, it finally closes above its confirmation SMA. The volume confirms when it is at highest within last several days and greater than its long-term SMA. The volume needs to confirm on the same day the price confirmation happens or on a later day when the close price is greater than its previous value. Input Parameters average length The number of bars used in calculation of the long-term SMA. This SMA is calculated for both price and volume. confirmation length The number of bars used in calculation of the short-term confirmation SMA of price. volume length Defines the confirmation period upon which the highest volume is found. Plots priceAvg The long-term SMA of the close price. Further Reading 1. \"Finding The Golden Triangle\" by Charlotte Hudgin. Technical Analysis of Stocks & Commodities, September 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "HACOLTStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/HACOLTStrat",
        "description": "Description The HACOLT strategy generates signals based upon HACOLT study values. Long Entry signal is generated when HACOLT reaches the \"100\" limit; Short Entry signal, when it falls to zero. Long Exit is performed when HACOLT fails to keep value of 100. Input Parameters Parameter Description tema length The number of bars used to calculate TEMA. ema length The number of bars used to calculate EMA. candle size factor The factor used in short candle determination. Values lower than 1.1 will provide faster exits. Further Reading 1. \"Long-Term Trading Using Exchange Traded Funds\" by Sylvain Vervoort. Technical Analysis of Stocks & Commodities, July 2012. 2. \"Trading with the Heikin-Ashi Candlestick Oscillator\" by Sylvain Vervoort. Technical Analysis of Stocks & Commodities, December 2008. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "Halloween",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/Halloween",
        "description": "Description The Halloween strategy is based on a well known principle “sell in May and go away\". Backtesting of this principle showed successful results, based on research of futures data on period from April 1982 to April 2003. The Halloween strategy is described in October 2012 issue of Technical Analysis of Stocks & Commodities by Gerald Gardner. In his article, Gardner uses leveraged ETFs to display the correlation between the stock equities and commodities, however, in TOS Charts users can apply this strategy to any chartable product. Long Entry signal is generated for the first bar in October which has price greater than its SMA . Long Exit signal is generated for the first bar in May. Input Parameters Parameter Description price The price used in calculations. length The number of bars used in calculation of SMA. Further Reading 1. \"A Seasonal Strategy with Leveraged ETFs\" by Gerald Gardner. Technical Analysis of Stocks & Commodities, October 2012. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "HybridSeasonalSystem",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/HybridSeasonalSystem",
        "description": "Description The Hybrid Seasonal System is a strategy based on the trading system designed by Markos Katsanos. In his trading system, Mr. Katsanos researches seasonal changes in the market as well as the changes in metrics such as average true range (ATR) , volatility index (VIX), and volume flow indicator (VFI) . Our version of the strategy adds simulated buy and sell orders based on threshold values of these metrics. Input Parameters Parameter Description atr length The length to calculate the average true range (ATR) with. vfi length The length to calculate the volume flow index with. atr pct chg The maximum ATR percent change. vix pct chg The maximum volatility index (VIX) percent change. vfi threshold The volume flow indicator (VFI) threshold. Further Reading 1. \"Stock Market Seasonality\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, April 2022. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "IFT_Stoch",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/IFT-Stoch",
        "description": "Description The IFT_Stoch strategy generates signals based upon IFT Stochastic Oscillator values. Long Entry signal is generated when IFTStoch Oscillator crosses above 30; Short Entry signal is generated when it crosses below 60 while price is lower than its 165 period SMA . When these conditions are met, strategy adds BUY_TO_OPEN and SELL_TO_OPEN orders, respectively. Long Exit signal is generated when IFTStoch Oscillator crosses below 60; Short Exit signal is generated when it crosses above 30. When these conditions are met, the strategy adds the corresponding exit orders. Input Parameters Parameter Description price The price used in calculations. length The number of bars in the main period in Stochastic calculation. slowing length The number of bars in the slowing period in Stochastic calculation. over bought The overbought level over sold The oversold level Further Reading 1. \"Applying the Put/Call Ratio Indicator\" by Sylvain Vervoort. Technical Analysis of Stocks & Commodities, December 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "InsideBarLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/InsideBarLE",
        "description": "Description The InsideBarLE strategy generates a Long Entry signal upon Inside Bar occurrence. A bar is considered Inside Bar if it has: Low price greater than that of the previous bar; High price lower than that of the previous bar. In the event of Inside Bar having Close price higher than the Open, this strategy generates the Long Entry signal for the next bar. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "InsideBarSE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/InsideBarSE",
        "description": "Description The InsideBarSE strategy generates a Short Entry signal upon Inside Bar occurrence. A bar is considered Inside Bar if it has: Low price greater than that of the previous bar; High price lower than that of the previous bar. In the event of Inside Bar having Close price lower than the Open, this strategy generates the Short Entry signal for the next bar. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "IntradayFlagFormationStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/IntradayFlagFormationStrat",
        "description": "Description The Intraday Flag Formation strategy is an attempt to successfully identify, enter, and exit the well-known Flag pattern on intraday charts. This approach was described by Markos Katsanos in his article \"Detecting Flags in Intraday Charts.\" Although intraday flags have the same geometric principles as daily ones, it is suggested that the former conform to more strict criteria. These apply mostly to the shape of flag elements (the pole and the flag itself) and their duration. You can customize the criteria in the input parameters, however, the current article discusses their default values. A simulated entry order is added when the flag is identified and all of the following is true: There is currently no open market position; The flag pole height is at least 5.5 times the average true range (ATR) and its formation takes no longer than 23 bars; The flag itself is not wider than 2.5 times the ATR and its formation takes no longer than 15 bars; There is an uptrend before the flag formation and it persists for at least 70 bars; Previous flag formation (if any) occurred at least 50 bars ago; The ATR has changed by at least 5% during the flag formation; A breakout from the formation occurs. When there is an open position, the strategy starts seeking exit possibilities. An exit order is added when any of the following is true: Price reaches the profit target equal to 1.2 times the pole; Price reaches the stop loss or the trailing stop loss (both customizable via input parameters); Inactivity period is longer than 70 bars. Inactivity means that the minimum favorable advance is less than 4 times the ATR; None of the above happens for 100 bars since the entry point. Input Parameters max flag length The maximum number of bars since the pole top. max flag height The maximum flag width, expressed in ATRs. max pole length The maximum duration of the pole formation, in bars. min pole height The minimum pole length (bottom-to-top), expressed in ATRs. up trend length The minimum duration of the preceding uptrend, in bars. min length between flags The minimum number of bars from the previous flag. min atr percent change The minimum ATR percent change during the formation. strict breakout If set to yes, the breakout is identified when the price grows out of the flag. If no, a bullish bar with close higher than the previous would suffice. profit target constant The profit target coefficient. The profit target is calculated as the pole top value times this coefficient. stop loss delay length Defines the length for the stop loss calculation. stop atr The number of ATRs that defines the stop loss below the flag. trail stop length Defines the length for the trailing stop calculation. trail stop atr The number of ATRs that defines the trailing stop. inactivity exit length The maximum inactivity duration, in bars. inactivity atr Defines the multiplier in the inactivity identification. time exit length Defines the maximum period for the position to be open. Further Reading 1. \"Detecting Flags In Intraday Charts\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, December 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "KeyRevLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/KeyRevLE",
        "description": "Description The KeyRevLE strategy generates a Long Entry signal when Key Reversal occurs. For the Long Entry strategy, a bar is considered Key Reversal if it has: Low price less than that of several previous bars; Close price higher than that of the previous bar. In the event of Key Reversal, this strategy generates the Long Entry signal for the next bar. Input Parameters Parameter Description length The number of preceding bars whose Low prices are compared to the current Low. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "KeyRevLX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/E-K/KeyRevLX",
        "description": "Description The KeyRevLX strategy generates a Long Exit signal when Key Reversal occurs. For the Long Exit strategy, a bar is considered Key Reversal if it has: High price greater than that of several previous bars; Close price lower than that of the previous bar. In the event of Key Reversal, this strategy generates the Long Exit signal for the next bar. Input Parameters Parameter Description length The number of preceding bars whose High prices are compared to the current High. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "LongHaul",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/LongHaul",
        "description": "Description The Long Haul strategy is a going-long-only trading system developed by Donald Pendergast Jr. While this system adds simulated orders based on a common technical indicator, Relative Strength Index (RSI) , it also involves thorough selection of the most suitable symbol for the strategy. In order to help you find potential trade candidates, we created the Long Haul Filter study, a thinkScript implementation of Donald Pendregast's stock criteria, adapted for usage in the Stock Hacker Scanning Tool. When an eligible stock is chosen, the strategy can be applied to it. Since its main principle is \"go long only\", Long Haul adds only long simulated orders: Buy To Open (long entry) and Sell to Close (long exit). The long entry simulated order is added when the RSI falls below the oversold level but fails to rise above the overbought level afterwards; it is added to the bar that closes above several previous highs and the slow average. The long exit simulated order is added when the close price falls below the fast average. Long Haul also uses a trailing stop: the strategy will exit right after the price drops below the three-bar lowest. Input Parameters Parameter Description fast length Defines the length of the fast average. slow length Defines the length of the slow average (this number should be sufficiently greater than the fast length). average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . rsi length Defines the length for the calculation of the Relative Strength Index (RSI). rsi over sold level Defines the oversold level for the RSI. rsi over bought level Defines the overbought level for the RSI. rsi average type Defines the type of moving average used in calculation of the RSI. high length Defines the period upon which the high prices are found. Used in checking whether the close price is greater than previous highs. Plots Plot Description FastMA The fast average plot. SlowMA The slow average plot. Further Reading 1. \"A Trading Method For The Long Haul\" by Donald W. Pendergast Jr. Technical Analysis of Stocks & Commodities, 2014, Bonus Issue. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MACDStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MACDStrat",
        "description": "Description The MACD strategy is based upon difference between values of Moving Average Convergence/Divergence (MACD) indicator and its moving average. The MACD, in turn, is defined as the difference between fast and slow moving averages of Close price: the length of the fast moving average is significantly less than that of the slow one (12 vs. 26 by default). The strategy adds a simulated Buy order when the difference between MACD and its signal line crosses above the zero level and a simulated Sell order when it crosses below. Input Parameters Parameter Description fast length The number of bars used in calculation of MACD's fast average. slow length The number of bars used in calculation of MACD's slow average. macd length The number of bars used in calculation of the moving average of MACD. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MajorBearMarketAwareStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MajorBearMarketAwareStrat",
        "description": "Description The Major Bear Market Aware strategy provides simulated buy and sell signals: it exits and avoids holding long positions in high-volatility bear market conditions. Developed by Markos Katsanos, this strategy examines market conditions based on a set of criteria that include historical and implied volatility, VIX readings, and values of such technical indicators as Average True Range (ATR) and Full Stochastic . A simulated sell to close signal is added when all of the following is true: Over the last four weeks, the price has dropped by at least 6%. Both shorter-term and longer-term stochastic indicator values have risen over 85 in the last four weeks, and the longer-term stochastic is currently above or the same as the shorter-term one. The VIX has spiked more than 100% or ATR has risen by at least 200% in the last 15 weeks. The price is below its 20-week moving average. The volume is at least 180% of its 50-week moving average. A simulated buy signal is added when all of the following is true: Over the last four weeks, the price has risen by at least 6%. The prior decline, however, is at least 15% (as calculated for the last 100 weeks). Both shorter-term and longer-term stochastic indicator values have fallen below 25 in the last four weeks and the longer-term stochastic is currently above or the same as the shorter-term one. The VIX has fallen by at least 30% or ATR has fallen by at least 60% in the last 15 weeks. Note : The numbers mentioned in the signal descriptions are default and can be edited. The strategy is designed to be used on weekly charts; consider adjusting the numbers if you apply it to a non-weekly chart. Input Parameters Parameter Description atr length The ATR length to be used in the calculations. stoch length1 The length of the faster stochastic. stoch length2 The length of the slower stochastic. atr pct chg buy The minimum percent ATR drop (buy condition). atr pct chg sell The minimum percent ATR increase (sell condition). vix pct chg buy The minimum percent VIX drop (buy condition). vix pct chg sell The minimum percent VIX increase (sell condition). price pct chg The minimum percent price change (both buy and sell conditions). stoch oversold The stochastic oversold level (buy condition). stoch overbought The stochastic overbought level (sell condition). Further Reading 1. \"Buy & Hold, Or Buy & Sell?\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, July 2021. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MeanReversionSwingLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MeanReversionSwingLE",
        "description": "Description The Mean Reversion Swing is a long entry strategy proposed by Ken Calhoun. Designed for swing trading purposes, this strategy adds a simulated long entry order when a mean reversion sequence (uptrend - 50% pullback - uptrend) is detected on chart. The sequence consists of three segments, which need to satisfy the following criteria (all specified numbers are used by default and may be customized in the input parameters): The first segment is an uptrend that lasts for at least 20 bars and, during this period, the price has risen by at least 5 dollars. The second segment is almost precisely 50% retracement; the precision can be controlled by the tolerance input parameter, which is set by default to 1%. The price then rises by at least 0.5 dollars. The maximum length of the entire sequence is 400 bars. Input Parameters Parameter Description min length Defines the minimum length of the first segment. max length Defines the maximum length of the entire pattern. min range for uptrend Defines the minimum high-low range of the first segment. min up move Defines the minimum up move in the third segment after which the simulated order is added. tolerance Defines the maximum possible deviation from the 50% retracement value for the second segment. Further Reading 1. \"Mean-Reversion Swing Trading\" by Ken Calhoun. Technical Analysis of Stocks & Commodities, December 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MiddleHighLowMAStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MiddleHighLowMAStrat",
        "description": "Description The Middle High Low MA (MHL MA) strategy is based on the eponymous study proposed by Vitali Apirine . The strategy adds simulated orders upon crossovers of a regular and a modified moving average (MA and MHL_MA) calculated by the study. The averages share the type and the length, however, the modified moving average is not applied to an OHLC value, but to the price mid-range. The mid-range is defined as the arithmetic mean of the highest high and the lowest low, both found on the same lookback period. According to the study, the relation between the lookback period and the moving average length is as follows: a lookback period of 3 to 15 bars is suggested for moving averages with length of up to 50; periods of 15 to 50 bars are to be combined with moving averages as slow as 50 to 200 bars in length. These numbers are referential and can be easily customized in strategy input parameters. Based on the behavior of the two averages, the strategy adds simulated orders as follows. If MA crosses above MHL_MA, the strategy adds a simulated buy order. Conversely, if MA crosses below MHL_MA, a simulated sell order is added. Input Parameters Parameter Description length Defines the length for calculation of both moving averages. high low length Defines the length of the period upon which the highest high and the lowest low prices are found. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Further Reading 1. \"The Middle-High-Low Moving Average\" by Vitali Apirine. Technical Analysis of Stocks & Commodities, August 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MomentumLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MomentumLE",
        "description": "Description The MomentumLE strategy generates a Long Entry signal when Momentum is rising. This strategy emulates a stop order at a certain price level: a signal is generated for the next bar at this level if the condition is fulfilled. This price level can be reached at the next bar's opening or during the course of trading. Momentum is calculated as the velocity of change in price over the specified number of bars. When the Momentum becomes a positive value and continues rising, the Long Entry signal is generated at the current High price plus one point (inverted value of the \"price scale\" parameter). Note that if the next Open price is greater than the current High plus one point, it is considered a price level to generate the signal at. Input Parameters Parameter Description length The number of bars to calculate the Momentum. price scale The number, inverting which an increment for the current High price is calculated. The sum of the inverted price scale value and the current High price defines the signal price level. price The price used in calculations of Momentum. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MovAvgStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MovAvgStrat",
        "description": "Description The Moving Average Strategy adds Buy and Sell orders upon crossovers of price with its moving average. By default, the Simple Moving Average (SMA) is used in calculations, nevertheless, you are free to use other types of moving averages: exponential , weighted , Wilder's , or Hull . Two modes of trading are used in this strategy: trend following and reversal. In the trend following mode, the strategy adds a simulated Buy order when the price crosses above its average, and a simulated Sell order when it crosses below. For the reversal mode, conditions are vice versa: a Buy order is added when the price crosses below the average and a Sell order is added when it crosses above. Input Parameters Parameter Description price Defines price used in calculation of the average. length The number of bars used in calculation of the average. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . mode Defines the mode of adding orders: trend following or reversal. Plots Plot Description Avg The average plot. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MovAvgTwoLinesStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MovAvgTwoLinesStrat",
        "description": "Description The Moving Average Two Lines strategy is based upon crossovers of fast and slow averages of price. The fast average's length is significantly less than that of the slow one. By default, crossovers are found for Exponential Moving Averages (EMAs) , however, you are free to use other average types: simple , weighted , Wilder's , or Hull . A simulated Buy order is added when the fast average crosses above the slow one, while the simulated Sell order is shown when it crosses below. Input Parameters Parameter Description price The price used in calculation of averages. fast length The number of bars used in calculation of the fast average. slow length The number of bars used in calculation of the slow average. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Plots Plot Description FastMA The fast moving average plot. SlowMA The slow moving average plot. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "MultiCurrencyCorrelation",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/MultiCurrencyCorrelation",
        "description": "Description The Multi-Currency Correlation strategy is based on the Multi-Currecncy Correlation Oscillator , which calculates the correlation coefficient between multiple currency pairs. A buy simulated order is added when the Multicurrency Correlation study's plot Corr is below the lower limit; a simulated sell order is added when the plot is above the upper limit. Input Parameters Parameter Description first currency Defines the first currency futures. second currency Defines the second currency futures. are one way pairs Defines whether the pairs are moving in the same direction or opposite directions. multiplier Coefficient expressing the relationship of currency pairs. upper limit Reference line for Sell signals. lower limit Reference line for Buy signals. Further Reading 1. \"Developing A Multi-Level Strategy\" by Vladimir Vladimirovich Voznjuk. Technical Analysis of Stocks & Commodities, September 2012. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "OnsetTrend",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/OnsetTrend",
        "description": "Description The Onset Trend strategy is based upon the Onset Trend Detector study, a zero-lag trend analyzing oscillator. This oscillator incorporates two filters, the Super Smoother Filter and the Roofing Filter , both developed by John F. Ehlers. Data derived from these two filters is processed by automatic gain control algorithm and then subjected to the quotient transform. The quotient transform, controlled by the K coefficient, collapses small oscillator values while keeping higher values high. The strategy uses the oscillator twice, with different values of K coefficient. This ensures more precise trend detection. Suggested values for the coefficient are 0.8 and 0.4, customizable via input parameters. The strategy adds a simulated Buy order when the first oscillator crosses above zero (which corresponds to uptrend detection) and a Sell to close order when the second oscillator crosses below zero (which signifies that the uptrend is over). Input Parameters Parameter Description price Defines the price to which the oscillator is applied. cutoff length Defines the minimum cycle length in bars. Cycles with lesser lengths will be considered noise and eliminated. roof cutoff length Defines the maximum cycle length in bars. Cycles with greater lengths will be considered spectral dilation and eliminated. k1 The K coefficient used in quotient transform for the first oscillator. k2 The K coefficient used in quotient transform for the second oscillator. Further Reading 1. \"The Quotient Transform\" by John F. Ehlers. Technical Analysis of Stocks & Commodities, August 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PairTradingLong",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PairTradingLong",
        "description": "Description The Pair Trading Long strategy is part of Domenico D'Errico's pair trading system. By design, this strategy is to be used along with Pair Trading Short . The two strategies provide entry and exit points for both the long and short securities traded in the pair. This requires that the second strategy be applied to the secondary symbol on a separate chart: consider either opening a detached chart window or using the chart grid. The Pair Trading Long strategy adds long entry and exit simulated orders to the primary symbol chart based on the price ratio of that symbol to the secondary; the ratio is analyzed in reference to its fast and slow simple moving averages. Based on the selected trending mode of the price ratio, the simulated orders will be added once specific moving average breakout conditions are met. Consider adding the Price Ratio study to a lower subgraph in order to determine the suitable trending mode. Trend following mode. In the trend following mode, the price ratio shows a clear trend: either bullish or bearish. Selecting this mode will have the strategy add a buy to open simulated order when the fast moving average crosses above the slow one. A sell to close simulated order will be added once the fast average crosses below the slow one. Mean reversion mode. In the mean reversion mode, the price ratio shows continuation of a preceding trend after a retracement of about 50%. Selecting this mode will have the strategy add a buy to open simulated order when the price ratio crosses below its fast moving average. Conversely, a sell to close simulated order will be added when it crosses above. Trend-and-pullback mode. In the trend-and-pullback mode, the price ratio shows numerous pullbacks in the main trend. Selecting this mode will have the strategy add a buy to open simulated order when the price ratio crosses below the fast moving average while being above the slow one. A sell to close simulated order will be added once the price ratio crosses above the fast average while being below the slow one. Input Parameters Parameter Description second symbol Defines the secondary symbol for the price ratio. This is also the symbol to apply the Pair Trading Short strategy to. fast length Defines the length of the fast simple moving average. slow length Defines the length of the slow simple moving average. mode Select a suitable trending mode of the price ratio. Further Reading 1. \"Pair Trading With A Twist\" by Domenico D'Errico. Technical Analysis of Stocks & Commodities, December 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PairTradingShort",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PairTradingShort",
        "description": "Description The Pair Trading Short strategy is the short signal counterpart in Domenico D'Errico's pair trading system. By design, this strategy is to complement Pair Trading Long on another chart (a detached chart window or a cell in the chart grid). Make sure you apply it to the secondary symbol you've specified in the Pair Trading Long strategy. The Pair Trading Short strategy adds simulated orders based on the same price ratio and its short and long moving averages calculated in Pair Trading Long, however, the direction of the orders is the opposite. Conditions are different for each of the three price ratio trending modes. Trend following mode. In the trend following mode, the price ratio shows a clear trend: either bullish or bearish. Selecting this mode will have the strategy add a sell to open simulated order when the fast moving average crosses above the slow one. A buy to close simulated order will be added once the fast average crosses below the slow one. Mean reversion mode. In the mean reversion mode, the price ratio shows continuation of a preceding trend after a retracement of about 50%. Selecting this mode will have the strategy add a sell to open simulated order when the price ratio crosses below its fast moving average. Conversely, a buy to close simulated order will be added when it crosses above. Trend-and-pullback mode. In the trend-and-pullback mode, the price ratio shows numerous pullbacks in the main trend. Selecting this mode will have the strategy add a sell to open simulated order when the price ratio crosses below the fast moving average while being above the slow one. A buy to close simulated order will be added once the price ratio crosses above the fast average while being below the slow one. Input Parameters Parameter Description first symbol Defines the primary symbol for the price ratio. This is also the symbol to apply the Pair Trading Long strategy to. fast length Defines the length of the fast simple moving average. slow length Defines the length of the slow simple moving average. mode Select a suitable trending mode of the price ratio. Further Reading 1. \"Pair Trading With A Twist\" by Domenico D'Errico. Technical Analysis of Stocks & Commodities, December 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PMOStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PMOStrat",
        "description": "Description The PMO Strategy is based on the signals provided by the Price Momentum Oscillator . The Price Momentum oscillator is a study developed by Carl Swenlin and is essentially the one-bar rate of change (relative momentum) consequently smoothed by two exponential moving averages. The signal line is a third exponential moving average of the double-smoothed rate of change. The strategy adds a simulated buy order when the main line crosses above the signal line. When the main line crosses below the signal line, a simulated sell order is added. Input Parameters Parameter Description price The price to be used in the calculation of PMO. length1 The length of the first exponential moving average to smooth the rate of change with. length2 The length of the second exponential moving average to smooth the rate of change with. signal length The length of the exponential moving average to be used as the signal line. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PriceSwing",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PriceSwing",
        "description": "Description The Price Swing strategy is a swing trading technical indicator introduced by Domenico D'Errico. This strategy adds entry and exit simulated orders when a swing (a rapid price move of either direction) of a specified type is detected. The strategy recognizes four types of swing: Pivot High-Low. This is a basic pivot point detection method: an upswing is detected if the low price first falls below its previous value, but then rises. Conditions for the downswing are vice versa, based on the high price. Bollinger Bands crossover. An upswing is detected if the price crosses above the lower plot of the Bollinger Bands. A downswing is detected when the price crosses below the upper plot of the Bollinger Bands. RSI Crossover. An upswing is detected if the RSI crosses above the oversold level (which is set by default to 40). A downswing is detected when it crosses below the overbought level (the default value is 60). RSI + Higher Low/Lower High. An upswing is detected if the current low price is greater than its previous value while the RSI is below oversold. A downswing is detected if the current high price is less than its previous value while the RSI is above overbought. The strategy adds a simulated buy-to-open order every time the upswing is detected. Sell-to-open simulated orders are added at downswings. Exits are provided when a specified period of time elapses, which defaults to 20 bars. Input Parameters Parameter Description swing type Defines the type of swing to be looked for on chart. length Defines the length with which the Bollinger Bands and the RSI will be calculated. exit length Defines the time period, completing which will have the strategy add a matching simulated exit order. deviations Defines the deviation multiplier for the Bollinger Bands. overbought Defines the overbought level. oversold Defines the oversold level. average type Defines the average type for the calculation of the Bollinger Bands and the RSI. Bollinger Bands is a registered trademark of John Bollinger. Further Reading 1. \"Detecting Swings\" by Domenico D’Errico. Technical Analysis of Stocks & Commodities, May 2017. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PriceZoneOscillatorLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PriceZoneOscillatorLE",
        "description": "Description The PriceZoneOscillatorLE strategy generates Long Entry signals when the Price Zone Oscillator (PZO) reaches certain levels. Uptrend and non-trending market conditions are considered in this strategy. To check for trend existence, PriceZoneOscillator strategies use the Average Directional Index (ADX). If the ADX indicates trending conditions, an exponential moving average (EMA) is used for defining trend direction. By default, the strategy employs the 14 period ADX and the 60 period EMA. In case the uptrend mode is spotted (ADX > 18, price above the EMA), Long Entry signals are issued when: the PZO plot crosses the \"-40\" level from below, or it surpasses the \"+15\" level after crossing the zero line from below. In non-trending conditions (ADX < 18), these signals are issued when the PZO plot crosses either the \"-40\" or \"+15\" level from below. Input Parameters Parameter Description price The price for which the PZO and EMA are calculated. length The number of bars used to calculate the PZO and the ADX. ema length The number of bars used to calculate the EMA. Further Reading 1. \"Entering the Price Zone\" by Walid Khalil and David Steckler. Technical Analysis of Stocks & Commodities, June 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PriceZoneOscillatorLX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PriceZoneOscillatorLX",
        "description": "Description The PriceZoneOscillatorLX strategy generates Long Exit signals when PZO values reach certain levels. Uptrend and non-trending market conditions are considered in this strategy. To check for trend existence, PriceZoneOscillator strategies use the Average Directional Index (ADX). If the ADX indicates trending conditions, an exponential moving average (EMA) is used for defining trend direction. By default, the strategy employs the 14 period ADX and the 60 period EMA. In case the trend mode is spotted (ADX > 18), Long Exit signals are issued when: PZO values rise above the \"+60\" level and start to go down afterwards, or the price is below EMA (downtrend) and PZO is negative. In non-trending conditions (ADX < 18), these signals are issued when: having crossed the \"+40\" level from above, the PZO rises above the \"+60\" level and starts to go down, or having crossed the \"+40\" level from above, the PZO falls below zero while the price is below the EMA, or having crossed the \"+15\" level from below, the PZO fails to rise above \"+40\" and falls below \"-5\". Input Parameters Parameter Description price The price for which the PZO and EMA are calculated. length The number of bars used to calculate the PZO and the ADX. ema length The number of bars used to calculate the EMA. Further Reading 1. \"Entering the Price Zone\" by Walid Khalil and David Steckler. Technical Analysis of Stocks & Commodities, June 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PriceZoneOscillatorSE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PriceZoneOscillatorSE",
        "description": "Description The PriceZoneOscillatorSE strategy generates Short Entry signals when PZO values reach certain levels. Downtrend and non-trending market conditions are considered in this strategy.To check for trend existence, PriceZoneOscillator strategies use the Average Directional Index (ADX). If the ADX indicates trending conditions, an exponential moving average (EMA) is used for defining trend direction. By default, the strategy employs the 14 period ADX and the 60 period EMA. In case the downtrend mode is spotted (ADX > 18, price below the EMA), Short Entry signals are issued when: the PZO plot crosses the \"+40\" level from above, or it falls below the \"-5\" level after crossing the zero line from above. In non-trending conditions (ADX < 18), these signals are issued when the PZO plot crosses either the \"+40\" or \"-5\" level from above. Input Parameters Parameter Description price The price for which the PZO and EMA are calculated. length The number of bars used to calculate the PZO and the ADX. ema length The number of bars used to calculate the EMA. Further Reading 1. \"Entering the Price Zone\" by Walid Khalil and David Steckler. Technical Analysis of Stocks & Commodities, June 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "PriceZoneOscillatorSX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/PriceZoneOscillatorSX",
        "description": "Description The PriceZoneOscillatorSX strategy generates Short Exit signals when PZO values reach certain levels. Downtrend and non-trending market conditions are considered in this strategy. To check for trend existence, PriceZoneOscillator strategies use the Average Directional Index (ADX). If the ADX indicates trending conditions, an exponential moving average (EMA) is used for defining trend direction. By default, the strategy employs the 14 period ADX and the 60 period EMA. In case the trend mode is spotted (ADX > 18), Short Exit signals are issued when: PZO values fall below the \"-60\" level and start to go up afterwards, or the price is above EMA (uptrend) and PZO is positive. In non-trending conditions (ADX < 18), these signals are issued when: having surpassed the \"-40\" level, the PZO falls below the \"-60\" level and starts to go up, or having surpassed the \"-40\" level, the PZO rises above zero while the price is above the EMA, or having crossed the \"-5\" level from above, the PZO fails to reach the \"-40\" level and rises above \"+15\". Input Parameters Parameter Description price The price for which the PZO and EMA are calculated. length The number of bars used to calculate the PZO and the ADX. ema length The number of bars used to calculate the EMA. Further Reading 1. \"Entering the Price Zone\" by Walid Khalil and David Steckler. Technical Analysis of Stocks & Commodities, June 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ProfitTargetLX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/ProfitTargetLX",
        "description": "Description The ProfitTargetLX strategy generates a Long Exit signal when the price grows by a certain amount relative to the entry price. Input Parameters Parameter Description offset type Defines units in which the price increase is measured. When it is set to \"value\", the increase will be measured in dollars. \"Tick\" will set the unit equal to ticksize. To define the increase as a percentage change of the entry price, select \"percent\". target Defines the price increase (in units specified in the \"offset type\" input parameter) at which the exit signal is generated. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ProfitTargetSX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/L-P/ProfitTargetSX",
        "description": "Description The ProfitTargetSX strategy generates a Short Exit signal when the price falls by a certain amount relative to the entry price. Input Parameters Parameter Description offset type Defines units in which the price decrease is measured. When it is set to \"value\", the decrease will be measured in dollars. \"Tick\" will set the unit equal to ticksize. To define the decrease as a percentage change of the entry price, select \"percent\". target Defines the price decrease (in units specified in the \"offset type\" input parameter) at which the exit signal is generated. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "R2Trend",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/R2Trend",
        "description": "Description As the first step, the R2Trend (RSquared) strategy calculates the RSquared , a technical indicator which measures how closely a data set of close prices conforms to the linear regression trendline. If the correlation is found to be higher than a certain threshold (the default value is 0.42), the strategy measures the steepness of the trendline, using Linear Regression Slope . Based on the premise that steeper slopes signify stronger trends (when the absolute value of the slope found is greater than the specified value), the overall trending conditions are evaluated by the strategy as follows: RSquared values being greater than both a lower threshold ( trend level in the input parameters) and its own prior value while the trendline slope is greater than critical - read as indication of a strong uptrend; RSquared values being greater than both a lower threshold ( trend level in the input parameters) and its own prior value while the trendline slope is less than the negative critical - read as indication of a strong downtrend. The first condition triggers a simulated buy-to open order if the close price rises above its own moving average. Vice versa, a simulated sell-to-open order is added when the second condition is true should the close price fall below the average. Simulated exit orders are added based on crossovers of the close price plot with its moving average: when the close price crosses below the average, a simulated sell-to-close order is added; when it crosses above - the simulation of buy-to-close takes place. Input Parameters length Defines the period for the calculation of the RSquared. r average length Defines the period for the calculation of the moving average for RSquared optimization. lag Defines the lookback period for the prior RSquared value. average length Defines the period for the calculation of the moving average. trend level Defines the minimum RSquared level at which strong trending conditions are recognized. max level Defines the maximum RSquared level at which strong trending conditions are recognized. lr crit level Defines the minimum trendline slope at which strong trending conditions are recognized. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Further Reading 1. \"Which Trend Indicator Wins?\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, October 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "RateOfChangeWithBandsStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/RateOfChangeWithBandsStrat",
        "description": "Description The Rate Of Change With Bands (ROCWB) strategy is based on the eponymous technical indicator developed by Vitali Apirine. This strategy acts on the combination of two factors: current trend and overbought/oversold conditions. The strategy attempts to detect uptrend by comparing the current price to an exponential moving average (EMA) ; overbought/oversold levels are detected based on the crossovers of the average rate of change with ROCWB bands. The strategy adds simulated orders based on the following conditions: Buy to open. A simulated order of this type is added when an uptrend is detected and the average ROC crosses above the lower band. Sell to close. A simulated order of this type is added either when the average ROC crosses below the upper band while in uptrend or when the price crosses below EMA. Sell to open. A simulated order of this type is added when the average ROC crosses below the upper band while in downtrend. Buy to close. A simulated order of this type is added either when the average ROC crosses above the lower band while in downtrend or when the price crosses above EMA. Input Parameters Parameter Description price The type of price to be used in calculations. roc length The length to calculate the rate of change with. average length The length to calculate the moving average with. rms length The length to calculate root mean square with. ema length The length to calculate the trend-detecting EMA with. num rmss Defines the distance between the average ROC and both upper and lower bands in standard deviations of the average ROC. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Plots Plot Description EMA Exponential moving average of price. Further Reading 1. \"Rate Of Change With Bands\" by Vitali Apirine. Technical Analysis of Stocks & Commodities, March 2021. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "RegressionDivergenceStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/RegressionDivergenceStrat",
        "description": "Description The Regression Divergence strategy is an intermarket correlation trading system developed by Markos Katsanos. It is based on Mr. Katsanos's technical indicator Regression Divergence and takes its approach even further: instead of two securities statistically analyzed by the indicator, the strategy takes into account three. The Regression Divergence is found between the prices of the current and the secondary symbol while also analyzing the correlation between rates of changes of the current and the tertiary symbol. This approach shows how well two symbols are correlated and how closely the current symbol follows the dynamic of the correlation. The strategy adds simulated buy and sell orders based on the following conditions: - Buy to open. The regression divergence rises above the critical level (set by default to 75) and then promptly reverses its direction while the correlation between the current and the tertiary symbols is below the correlation reference level (which defaults to 0.8). By default, the regression divergence needs to reverse over the next three bars for the signal to be triggered. - Sell to open. The regression divergence falls below the critical level and then promptly (over the next three bars, by default) reverses its direction while the correlation between the current and the tertiary symbols is below the correlation reference level. - Exits (both buy and sell). The maximum number of bars is reached since the entry; by default, this number is set to 11. Input Parameters Parameter Description symbol2 Defines the symbol to calculate the divergence with. symbol3 Defines the symbol to find the ROC correlation with. length Defines the regression length. roc length Defines the period over which the rates of change are calculated. divergence length Defines the period over which the divergence is calculated. divergence momentum length Defines the time offset (in bars) for the calculation of the forecast price. exit length The number of bars between the entry and the exit. lag Defines the number of bars within which the divergence reversal should happen. divergence critical level Defines the reference level of divergence between the current and the secondary symbol. corr3level Defines the reference level of correlation between the current and the tertiary symbol. Further Reading 1. \"Trading The Nikkei\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, July 2017. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ReverseEMAStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/ReverseEMAStrat",
        "description": "Description Reverse EMA strategy is based on a modification of the regular exponential moving average (EMA) . This modification contains signal processing technique Z-transform, which is said to eliminate the indicator lag and make the indicator suitable for trend and market data cycle analysis. The strategy calculates two Reverse EMAs. The Reverse EMA with a greater length is used to analyze trend conditions while the shorter Reverse EMA is used to analyze market data cycles. Based on behavior of these two values, simulated buy and sell orders are added according to the following rules: Buy to open: shorter Reverse EMA crosses above the zero level while longer Reverse EMA is positive. Sell to close: either Reverse EMA falls below zero. Sell to open (short entry): shorter Reverse EMA crosses below zero while longer Reverse EMA is negative. Buy to close (short exit): either Reverse EMA crosses above the zero level. Input Parameters Parameter Description price The type of price to apply the Reverse EMAs to. trend length The length of the Reverse EMA to analyze trends with. cycle length The length of the Reverse EMA to analyze market data cycles with. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "RSIStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/RSIStrat",
        "description": "Description The Relative Strength Index (RSI) strategy is based upon the eponymous technical indicator . The RSI is an oscillator comparing the magnitude of a stock's recent gains to the magnitude of its recent losses on a scale from 0 to 100. Buy and Sell signals occur upon crossovers of RSI values with oversold and overbought levels. The strategy adds a simulated Buy order when the RSI crosses above the oversold level and a simulated Sell order when it crosses below the overbought level. Input Parameters Parameter Description price Defines price used in calculations. length Defines the number of bars used in calculation of RSI. over bought Defines the overbought level. over sold Defines the oversold level. rsi average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "RSITrend",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/RSITrend",
        "description": "Description The RSI Trend strategy is developed by Kevin Luo; it attempts an improvement of the classical Relative Strength Index (RSI) strategy, adapted for usage in longer-term trend conditions. Based upon the observation that the RSI strategy tends to overreact to minor changes in long trend conditions, this updated version introduces a trend filter. This strategy detects existence of a trend and only reacts if the trend is strong enough. This is believed to minimize the reaction to minor and temporary changes in the trend, thus indicating fewer false signals. A simulated buy order is added when the RSI crosses above the oversold level in strong uptrend conditions. Rules for simulated sell signals are vice versa: these are added in strong downtrend upon the RSI falling below the overbought level. Trend existence and strength are analyzed here using the ZigZagTrendPercent indicator. Input Parameters price The price to be used in calculations. length The period used in calculation of RSI. over bought The overbought level. over sold The oversold level. percentage reversal The threshold percentage of the price used in the calculation of ZigZagTrendPercent. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Description 1. \"The RSI & Price Trends\" by Kevin Luo. Technical Analysis of Stocks & Commodities, June 2015. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "RSMKStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/RSMKStrat",
        "description": "Description RSMKStrat is a strategy introduced by Markos Katsanos. It is based on the eponymous technical indicator , which calculates the strength of a security relative to another security or index. The strategy adds a buy to open simulated order when RSMK crosses above the zero level (which signifies that the primary security starts to outperform the secondary one). This simulated order is automatically closed by an opposite simulated order after a specified number of bars elapses since the entry. Input Parameters Parameter Description correlation with security The security or index to compare the primary symbol with. rs length The period to calculate the relative strength for. average length The length of the exponential moving average. time exit length The number of bars that are to elapse before the simulated position is automatically closed. Further Reading 1. \"Using Relative Strength To Outperform The Market\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, March 2020. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SeasonalTrading",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SeasonalTrading",
        "description": "Description Seasonal Trading is a strategy designed by Perry J. Kaufman in an attempt to explore seasonal patterns in stock price. The strategy analyzes monthly price action using the Monthly Seasonality study and adds simulated buy and sell orders based on the resulting values. As monthly action is taken into account, this strategy is to be used on monthly charts only. Calculation The price data is run through Monthly Seasonality to reveal seasonal patterns and identify the months with the highest and the lowest frequency of positive returns. The default level of high positive-return frequency is 75. For low positive-return frequency, the default level is 25. The frequency is calculated for each month over the last four years by default. Simulated orders Seasonal Trading adds simulated orders according to the following rules: A Buy simulated order is added at the end of a month with a consistently low frequency of positive returns. A Sell simulated order is added at the end of a month with a consistently high frequency of positive returns. Input Parameters Parameter Description years The period for which the frequencies of positive returns for each month are to be calculated. high frequency The minimum high-frequency level. low frequency The maximum low-frequency level. Further Reading 1. \"A Simple Way To Trade Seasonality\" by Perry J. Kaufman. Technical Analysis of Stocks & Commodities, September 2019. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SentimentZone",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SentimentZone",
        "description": "Description The Sentiment Zone strategy is based on values of Sentiment Zone Oscillator (SZO) and their relation with dynamic overbought and oversold levels. The strategy adds a BUY_AUTO order when any of the following conditions is fulfilled: 30 period SMA of SZO crosses above the zero level and price is higher than its 60 period EMA. SZO is below the oversold line, its 30 period SMA is rising and price is higher than its 60 period EMA. SZO crosses above the oversold line, its 30 period SMA is positive and 60 period EMA of price is rising. The strategy adds a SELL_AUTO order when any of the of the following conditions is fulfilled: 30 period SMA of SZO crosses below zero. SZO crosses below the \"+7\" level while its 30 period SMA is declining. Input Parameters Parameter Description price The price used in main plot calculation. length The number of bars used in main plot calculation. long length The number of bars used in calculation of overbought and oversold levels. percent The percentage used in calculation of overbought and oversold levels. Further Reading 1. \"Sentiment Zone Oscillator\" by Walid Khalil. Technical Analysis of Stocks & Commodities, May 2012. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SimpleMeanReversion",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SimpleMeanReversion",
        "description": "Description Simple Mean Reversion is a strategy created by Anthony Garner. It is based on the theory that when prices move too far away from the mean, there is a chance of price reversion. The strategy adds simulated buy and sell signals based on the following values: price, two simple moving averages, and zScore. The latter is the ratio of the difference between the price and its average to the standard deviation of the price. The strategy adds simulated orders based on the following conditions: Buy to open: zScore falls below -1.0 while the faster SMA is above the slower one; Sell to close: zScore rises above -0.5; Sell to open: zScore rises above 1.0 while the faster SMA is below the slower one; Buy to close: zScore falls below 0.5. By default, the faster SMA has the length equal to the length with which zScore is calculated. The slower SMA has the length ten times the length of zScore. All the mentioned numbers can be customized in the input parameters. Input Parameters Parameter Description price The price for which the averages and zScore are to be calculated. length The length with which zScore is to be calculated. fast length factor The factor by which length is to be multiplied to obtain the length of the faster moving average. slow length factor The factor by which the length is to be multiplied to obtain the length of the slower moving average. z score entry level Defines the critical value of zScore for triggering a simulated sell-to-open order. For simulated buy-to-open orders, the opposite number is used. z score exit level Defines the critical value of zScore for triggering a simulated buy-to-close order. For simulated sell-to-close orders, the opposite number is used. Plots Plot Description FastMA The fast moving average plot. SlowMA The slow moving average plot. Further Reading 1. \"Backtesting A Mean-Reversion Strategy In Python\" by Anthony Garner. Technical Analysis of Stocks & Commodities, May 2019. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SimpleROCStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SimpleROCStrat",
        "description": "Description The Simple ROC strategy adds simulated buy and sell signals based on the rate of change of the two-bar price momentum. The strategy can be used in two modes: with or without the modified FM Demodulator , which is an indicator that singles out the frequency modulation component out of market data cycles. In both modes, a buy to open simulated order is added when the rate of change of the signal variable crosses above zero, and a sell to close simulated order is added when the signal variable crosses below zero. The difference between the two modes is in how the signal variable is calculated. In the plain mode, it is an average of the sum of the four last consecutive two-bar price momentums. In the FM Demodulator mode, it is an average of the modified FM Demodulator’s Timing output of the two-bar momentum. Input Parameters Parameter Description signal length The length of the average to calculate the signal variable with. roc length The length of the rate of change. rms length The length to calculate the root mean square with (only used in the FM Demodulator mode). use fm demodulator Defines whether or not the modified FM Demodulator should be used in the calculation. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SimpleTrendChannel",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SimpleTrendChannel",
        "description": "Description The Simple Trend Channel strategy is the second step in the trading system developed by James E. Rich and John B. Rich. The first step in the system is recognizing stocks with which this strategy should be employed; to find these stocks, use the filter based on the overall market trend direction. In addition to the three simple moving averages calculated in the filter, the Simple Trend Channel calculates two more, this time, to produce trading signals: A buy to open simulated order is added if the filter indicates uptrending conditions, the close price crosses above the 8-period SMA of the high, and there is no earnings announcement scheduled for the next two days. A sell to close simulated order is added either if the close price falls below the 8-period SMA of the low or if it’s simply the day before the earnings are announced. A sell to open simulated order is added if the filter indicates downtrend, the close price crosses below the 8-period SMA of the low, and there is no earnings announcement scheduled for the next two days. A buy to close simulated order is added either if the close price rises above the 8-period SMA of the high or if the earnings announcement is scheduled for the next day. Input Parameters trend check Defines how strict the trend check needs to be. Plots Average A 50-period SMA of the close price; used in all trend check modes. FastAverage A 20-period SMA of the close price; used in \"Normal\" and \"Max\" trend check modes. SlowAverage A 200-period SMA of the close price; used in the \"Max\" trend check mode. UpperBand An 8-period SMA of the high price; used for signal production. LowerBand An 8-period SMA of the low price; used for signal production. Further Reading 1. \"Simplify It\" by James E. Rich with John B. Rich. Technical Analysis of Stocks & Commodities, November 2015. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SpectrumBarsLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SpectrumBarsLE",
        "description": "Description The SpectrumBarsLE strategy generates a Long Entry signal when a Green or Blue item of the Spectrum Bars study appears (Close price is greater than that from a specified number of bars ago). Note that, by default, this strategy can only be used to open a new position but not to close the existing one. Input Parameters Parameter Description length The number of bars prior to the current bar used to find the past Close price. Further Reading 1. \"A Color-Based System for Short Term Trading\" by Edgar Kraut. Technical Analysis of Stocks & Commodities, July 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "StiffnessStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/StiffnessStrat",
        "description": "Description The Stiffness strategy is based on the eponymous technical indicator designed by Markos Katsanos. The indicator measures the trend strength based on how many times the price has closed above the 100-bar simple moving average during the lookup period, taking into account the volatility threshold. The strategy performs a check for uptrend by analyzing exponential moving average values. Uptrend is detected if the moving average value of a market index rises over the last two bars. A simulated buy-to-open order is added if uptrend is detected and the Stiffness indicator rises above the entry level (90 by default). A simulated sell-to-close order is added if the Stiffness indicator falls below the exit level (50 by default) or after a specified period finishes (84 bars by default). Input Parameters Parameter Description price The price to be used in the calculation of the Stiffness indicator. length The period to be analyzed by the Stiffness indicator. average length The length of the simple moving average. exit length The maximum holding period since the entry. num dev The volatility threshold, measured in standard deviations. The price is only considered to be above the moving average if it is greater than the average by this value. entry stiffness level The level of the Stiffness indicator at which the buy-to-open simulated order is added. exit stiffness level The level of the Stiffness indicator at which the sell-to-close simulated order is added. market index The market index to check for uptrend. Further Reading 1. \"The Stiffness Indicator\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, November 2018. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "Stochastic",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/Stochastic",
        "description": "Description The Stochastic Overbought/Oversold strategy is based on the Stochastic Full technical indicator. The Stochastic Full study is an oscillator based on the observation that as prices increase, closing prices tend to be closer to the upper end of the price range. In downtrends, the closing price tends to be near the lower end of the range. The strategy adds a simulated Buy order when the Stochastic Full crosses above the oversold level and a simulated Sell order when it crosses below the overbought level. Input Parameters Parameter Description price h Type of price whose highest value is found on the specified period. price l Type of price whose lowest value is found on the specified period. price c The latest closing price. k period Number of bars used to calculate the FastK. slowing period The period used for averaging the Stochastic Fast. over bought Defines the overbought level. over sold Defines the oversold level. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "StopLossLX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/StopLossLX",
        "description": "Description The StopLossLX strategy generates a Long Exit signal when the price falls by a certain amount relative to the entry price. Input Parameters Parameter Description offset type Defines units in which the price decrease is measured. When it is set to \"value\", the decrease will be measured in dollars. \"Tick\" will set the unit equal to ticksize. To define the decrease as a percentage change of the entry price, select \"percent\". stop Defines the price decrease (in units specified in the \"offset type\" input parameter) at which the exit signal is generated. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "StopLossSX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/StopLossSX",
        "description": "Description The StopLossSX strategy generates a Short Exit signal when the price rises by a certain amount relative to the entry price. Input Parameters Parameter Description offset type Defines units in which the price increase is measured. When it is set to \"value\", the increase will be measured in dollars. \"Tick\" will set the unit equal to ticksize. To define the increase as a percentage change of the entry price, select \"percent\". stop Defines the price increase (in units specified in the \"offset type\" input parameter) at which the exit signal is generated. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "Stress",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/Stress",
        "description": "Description The Stress strategy is based upon the Stress Indicator , a stochastic type study developed by Perry Kaufman. Data derived from the Stress Indicator is adapted for hedging and expanded with several safety techniques, such as stop-loss and minimum price. In addition to adding standard simulated buy and sell orders, the Stress strategy marks time points where hedging the instrument with an index could be or could have been useful. It also calculates the hypothetical hedging size for these points. Simulated Trade Orders An initial simulated buy order is added when the Stress Indicator falls below the specified entry level and the index is in uptrend. After an exit, the simulated buy order is only added when the Stress Indicator falls below the entry level from above 50. The simulated sell order is added when any of the following conditions are true: Stress Indicator goes above the exit level; Decline in price from the entry point exceeds the stop-loss percentage value; Price falls below the minimum level at least once during the specified min price length period. Hedging Hedging is treated by the strategy as an independent process solely based on the trend of the chosen index. When index is in downtrend, the strategy indicates that hedging could be useful and calculates the hypothetical hedge size. Here, the downtrend is identified when the average close price of the index falls. The hedging size (i.e., the trading of the index) is calculated as hedge ratio times stock position times stock to index volatility ratio. Both stock volatility and index volatility are calculated using the standard deviation formula. Input Parameters Parameter Description index Defines the index to be used in hedging with the specified stock. length The period upon which the highest and the lowest prices of both the index and the stock are found; used in stochastic calculation. investment Defines hypothetical investment for simulated buy orders. Trade size of the stock is equal to this value divided by close price. entry level Defines the entry level for the simulated buy condition. exit level Defines the exit level for the first simulated sell condition. stop loss Defines the critical percentage of the price decline from the entry point; used in the second simulated sell condition. min price Defines the critical percentage of the price decline from the entry point; used in the third simulated sell condition. min price length Defines the period for the third simulated sell condition. hedge length Defines the period for calculation of standard deviations and average close price of the index. hedge ratio Defines the ratio of the hedge-protected position size to the size of the entire position; used in the index trade size calculation. Plots Plot Description HedgeSignal Displays possible opportunities for hedging. HedgeSize Displays hypothetical hedging size. Further Reading 1. \"Timing The Market With Pairs Logic\" by Perry Kaufman. Technical Analysis of Stocks & Commodities, March 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SVEHaTypCross",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SVEHaTypCross",
        "description": "Description The SVEHaTypCross strategy is a trading system which combines price plot coloring, moving averages, and Buy/Sell triggers. These three elements are based upon Heikin Ashi values. Two EMAs (exponential moving averages) are calculated for the system: EMA of typical price and that of average price of Heikin Ashi bars. These averages form two plots which produce Buy and Sell signals for the strategy. A Buy signal is given when the first average crosses above the second at a bullish bar; conversely, a Sell signal is given when the crossover of opposite direction happens at a bearish bar. These signals also divide the price plot into trending sections: those between consecutive Buy and Sell signals are considered uptrend and colored green while those between consecutive Sell and Buy signals are considered downtrend and colored gray. The plots and coloring system are added to this strategy in order to facilitate your decision whether to use the default parameters or to adjust them. Input Parameters Parameter Description typical length Defines period on which EMA of typical price is calculated. ha length Defines period on which EMA of Heikin Ashi average price is calculated. paint bars Defines whether or not to apply the coloring system. Plots Plot Description AvgTyp The EMA of typical price. AvgHAC The EMA of Heikin Ashi average price. Further Reading 1. \"An Expert of a System\" by Sylvain Vervoort. Technical Analysis of Stocks & Commodities, October 2013. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SVESC",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SVESC",
        "description": "Description The SVESC strategy is a sample technical indicator described by Sylvain Vervoort in an article for the Technical Analysis of Stocks and Commodities magazine. The author emphasizes that this strategy is shown for educational purposes only. In order to simulate Buy and Sell orders, the strategy calculates three averages: one of hlc3 (arithmetic mean of high, low, and close), one of Heikin Ashi ohlc4 (arithmetic mean of Heikin Ashi open, high, low, and close), and one of the close price. The simulated orders are added upon the following conditions: Buy Auto . Average hlc3 price rises above the average Heikin Ashi price at a bullish bar. Sell Auto . Average hlc3 price falls below the average Heikin Ashi price at a bearish bar. Buy To Close . There is a short position and the close is greater than both its average value and the open. Sell To Close . There is a long position and the close is less than both its average value and the open. Input Parameters length The number of bars used in the calculation of averages of hlc3 and Heikin Ashi prices. exit length The number of bars used in the calculation of the close price average. Plots AveragePrice The average of hlc3. AverageHaPrice The average of Heikin Ashi ohlc4. AverageExit The average of the close price. Market A histogram that illustrates how the simulated orders are added. Further Reading 1. \"Exploring Charting Techniques: Creating A Trading Strategy\" by Sylvain Vervoort. Technical Analysis of Stocks & Commodities, October 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SVEZLRBPercBStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SVEZLRBPercBStrat",
        "description": "Description The SVEZLRBPercB strategy is based upon the eponymous study , a zero-lag oscillator which smooths data with Rainbow, Double Exponential, and Triple Exponential Moving Averages, combined with a stochastic one. A Buy signal is given when the study's PercentB and Stochastic plots both get higher than their respective previous values (i.e., both start rising); Sell signal when they start decreasing. Input Parameters Parameter Description price The price with which the Rainbow Moving Average is calculated. std dev length Defines period on which standard deviation is found. ema length Defines period on which moving averages are calculated. num dev The number of standard deviations defining the half-distance between the bands. k period Defines FastK period for stochastic calculation slowing period Defines length of moving average for stochastic calculation. Further Reading 1. \"Oscillators, Smoothed\" by Sylvain Vervoort. Technical Analysis of Stocks & Commodities, September 2013. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "SwingThree",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/R-S/SwingThree",
        "description": "Description The Swing Three strategy is a basic momentum/breakout trading system developed by Donald Pendergast. Based upon the most common technical indicators, such as simple (SMA) and exponential (EMA) moving averages, it is best suitable for volatile, high-volume stocks and ETFs that show smooth, regular swing and/or trend moves. The main principle of the strategy suggests that the entries be taken when their direction is aligned with the trend. In this particular strategy, the trend is determined by the 50 period EMA of the Close price (customizable via strategy input parameters). The strategy also calculates two simple moving averages: SMA of High price and that of the Low price, to be used as signal lines. Once all the three averages are calculated, the strategy will add simulated orders upon the following conditions: A Long Entry order is added when price exceeds the SMA of High price by the specified number of ticks (5 by default) and the previous bar has closed above the EMA; A Long Exit order is added when the Low price fails to exceed its SMA; A Short Entry condition is inverse of the Long Entry one: it is added when price falls below the SMA of Low price minus the specified number of ticks and the previous bar has closed below the EMA; A Short Exit order is added when the High price goes above its SMA. Input Parameters Parameter Description sma length The number of bars used to calculate SMAs of High and Low prices. ema length The number of bars used to calculate the EMA of Close price. tick sizes Defines the number of ticks in the offset from the EMA; used in entry signal conditions. Plots Ema The exponential moving average (EMA) plot. SmaHigh The simple moving average (SMA) of High price plot. SmaLow The simple moving average (SMA) of Low price plot. Further Reading 1. \"Swing Trading With Three Indicators\" by Donald Pendergast. Technical Analysis of Stocks & Commodities, December 2013. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "TAC_DMI",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/TAC-DMI",
        "description": "Description The TAC_DMI strategy is based on trading system described in BC Low's article \"Identify the Start of a Trend with DMI\"; it uses three technical indicators: TAC_ADX , TAC_DIPlus , and TAC_DIMinus . These indicators attempt to identify start and end points of trend, market tops, and market bottoms. Long Entry signal is generated when TAC_DIPlus clusters below level 10 and its lower line reaches level 5 while TAC_ADX cluster turns down from level 70. Short Entry signal is generated when TAC_DIMinus clusters below level 10 and its lower line reaches level 5 while TAC_ADX cluster turns down from level 70. Main signals are accompanied with additional ones indicating that a trend might be emerging or terminating. Signal of possible trend start is given when TAC_ADX cluster turns up from below 30; a stronger version of this signal occurs when the cluster turns up from below 20. The other signal suggests trend termination, it is generated when TAC_ADX cluster turns up from below 70. For a stronger version of this signal, consider level 90 instead. Although TAC_DMI strategy does not add simulated orders upon trend start/termination signals, they are marked on chart and can be used for confirmation of the main ones. Input Parameters Parameter Description adx length1 The number of bars used to calculate the first ADX for TAC_ADX. adx length2 The number of bars used to calculate the second ADX for TAC_ADX. adx length3 The number of bars used to calculate the third ADX for TAC_ADX. di length1 The number of bars used to calculate the first plot of both DI+ and DI-. di length2 The number of bars used to calculate the second plot of both DI+ and DI-. di length3 The number of bars used to calculate the third plot of both DI+ and DI-. tolerance The tolerance coefficient used in cluster identification. Setting this value to zero will define the cluster as intersection of the three lines at a single point. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Plots Plot Description Signal1 Additional signals indicating that the trend might be emerging. Signal2 Additional signals indicating that the trend might be terminating. Further Reading 1. \"Identify the Start of a Trend with DMI\" by BC Low. Technical Analysis of Stocks & Commodities, November 2012. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "TechnicalStockRatingStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/TechnicalStockRatingStrat",
        "description": "Description The Technical Stock Rating strategy is based on a stock rating system developed by Markos Katsanos. The strategy uses rating scores provided by the eponymous study to add simulated buy orders. The score is calculated based on stock performance in terms of meeting five technical analysis criteria. The following criteria are taken into account when assigning a rating to a stock symbol: Money flow: This criterion is met if the symbol's current Volume Flow Indicator value is positive. Trading above average: This criterion is met if the close price is greater than its simple moving average (SMA). In uptrend: This criterion is met if the SMA value has increased over the last four bars. Trend quality: This criterion is met if the total number of crossovers between the price and its moving average during the lookup period does not exceed a certain value. Overall market direction: This criterion is met if the exponential moving average of the appropriate market index has increased over the last two bars. The stock symbol receives one point for meeting each of the above criteria if all the weights are set to 1.0. By default, only the \"overall market direction\" weight is equal to 2.0; however, you are free to assign the weights according to your preferences. By default, the strategy adds a simulated buy to open order if the currently selected stock receives a rating score of 5.0 or higher. A simulated sell to close order is added when a specified number of bars elapses since the entry, which is by default set to 63. Input Parameters Parameter Description vfi length Defines the period for which the Volume Flow Index is calculated. Used when checking for the \"money flow\" criterion. average length Defines the period for which the simple moving average is calculated. Used when checking for the \"trading above average\" and \"in uptrend\" criteria. trend quality length Defines the lookup period for checking for the \"trend quality\" criterion. exit length Defines how many bars are to elapse since the simulated entry for the simulated sell to close order to be added. max stiffness Defines the maximum number of times the price is allowed to break through the SMA during the \"trend quality\" lookup period. market index Defines the market index to check for the \"overall market direction\" criterion. score crit Defines the minimum stock rating score for the simulated buy to open order to be added. weight for money flow Defines the weight for points scored for meeting the \"money flow\" criterion. weight for trading above average Defines the weight for points scored for meeting the \"trading above average\" criterion. weight for uptrend Defines the weight for points scored for meeting the \"in uptrend\" criterion. weight for trend quality Defines the weight for points scored for meeting the \"trend quality\" criterion. weight for market direction Defines the weight for points scored for meeting the \"overall market direction\" criterion. Further Reading 1. \"A Technical Method For Rating Stocks\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, June 2018. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ThreeBarInsideBarLE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/ThreeBarInsideBarLE",
        "description": "Description The ThreeBarInsideBarLE strategy generates a Long Entry signal when a positive Three-Bar Inside Bar pattern occurs. If an inside bar formed inside two higher closes, then it is considered to be a three-bar inside bar positive reversal. The positive Three-Bar Inside Bar pattern is recognized if: The first bar's Close price is lower than that of the second bar; The third bar's High price is less than that of the previous bar; The third bar's Low price is greater than that of the previous bar; The fourth bar's Close price is higher than that of the previous bar; In the event of the positive Three-Bar Inside Bar pattern, this strategy generates the Long Entry signal for the next bar. Note that this strategy can only be used to initiate a position and not to extend an existing one. It can be accompanied with ThreeBarInsideBarSE for short entries (with ProfitTargetSX and StopLossSX for short exits), ProfitTargetLX and StopLossLX for long exits. Note that, by default, this strategy can only be used to open a new position but not to close the existing one. Further Reading 1. \"Three-Bar Inside Bar Pattern\" by Johnan Prathap. Technical Analysis of Stocks & Commodities, March 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ThreeBarInsideBarSE",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/ThreeBarInsideBarSE",
        "description": "Description The ThreeBarInsideBarSE strategy generates a Short Entry signal when a negative Three-Bar Inside Bar pattern occurs. If an inside bar formed inside two lower closes, then it is considered to be a three-bar inside bar negative reversal. The negative Three-Bar Inside Bar pattern is recognized if: The first bar's Close price is higher than that of the second bar; The third bar's High price is less than that of the previous bar; The third bar's Low price is greater than that of the previous bar; The fourth bar's Close price is lower than that of the previous bar; In the event of the negative Three-Bar Inside Bar pattern, this strategy generates the Short Entry signal for the next bar. Note that this strategy can only be used to initiate a position and not to extend an existing one. It can be accompanied with ThreeBarInsideBarLE for long entries (with ProfitTargetLX and StopLossLX for long exits), ProfitTargetSX and StopLossSX for short exits. Note that, by default, this strategy can only be used to open a new position but not to close the existing one. Further Reading 1. \"Three-Bar Inside Bar Pattern\" by Johnan Prathap. Technical Analysis of Stocks & Commodities, March 2011. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "ThreePeriodDivergence",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/ThreePeriodDivergence",
        "description": "Description The Three Period Divergence strategy is a trading system developed by Perry Kaufman, which is based upon analysis of momentum-price divergence. Best applied to daily price data, this strategy identifies time points where a momentum indicator (in our case, the Stochastic ) and the price move away from each other. Divergences occur in two directions: a bearish divergence is identified when the price rises and the momentum falls, a bullish divergence is vice versa. While looking for divergences is quite a popular technique to follow, it is not always obvious which timeframe should be used or even how the divergence can be determined. Moreover, divergence signals can often be misleading, thus confirmation of these signals is crucial. Three Period Divergence addresses these problems as follows: Divergence is looked for based on linear regression slopes of the momentum (either the FastK or the FastD component of the Stochastic) and the price; Momentum needs to be defined on the period from five to 40 days; Linear regression slopes for both the price and the momentum are found on three periods (Mr. Kaufman suggests that the first period be 5 days, the second period from six to 12, and the third one from seven to 15); Divergence occurs when the signs of the momentum slope and the price slope are opposite; In order to confirm the divergence, momentum slope is compared to the price slope on each of the calculation periods (the divergences must be all in the same direction). Note: these periods are defined here as ranges; this is due to the fact that suitable periods differ from symbol to symbol, thus the strategy allows for optimization. Note also that searching for the divergence on each of the three calculation periods might reduce the number of signals. However, changing input parameters will allow you to search where the divergence occurs on at least two (or even one) of the three periods. Once the divergence is identified, strategy adds simulated orders based on the dollowing rules: a buy signal is added when the bearish divergence occurs on the specified number of calculation periods out of three, and a sell signal when the bullish divergence is identified (on the same number of periods). Strategy will exit when all three price slopes are of the same sign as those of the momentum. Input Parameters Parameter Description fast momentum Defines whether the momentum is calculated as the FastK component of the Stochastic (otherwise the FastD component is used). momentum length Defines the period on which the momentum is calculated. dvg length1 Defines the shortest of the periods for the calculation of slopes. dvg length2 Defines the middle period for the calculation of slopes. dvg length3 Defines the longest of the periods for the calculation of slopes. entry number Defines the number of divergences sufficient for signal generation. max divergences Defines on how many periods the price and the momentum need to move in the same direction for the strategy to exit. long only Setting this input to \"yes\" will disable all short entry and short exit simulated orders. Further Reading 1. \"Slope Divergence: Capitalizing On Uncertainty by Perry Kaufman. Technical Analysis of Stocks & Commodities, June 2014. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "TrailingStopLX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/TrailingStopLX",
        "description": "Description The TrailingStopLX strategy generates a Long Exit signal when the Low price gets less than the Trailing Stop value. This value is based on Stop Price which is equal to prior Entry price minus specified offset. The offset can be measured in percent, actual price points, or ticks (see input parameters' description for details). The Trailing Stop value raises the Stop Price as the market price increases; if however the market price fails to rise, the Stop Price remains unchanged. Input Parameters Parameter Description trail stop Defines the offset value in units specified for the \"offset type\" parameter. offset type Defines units in which the price offset is measured. When it is set to \"value\", the offset will be measured in dollars. \"Tick\" will set the unit equal to ticksize. To define the offset as percentage change, select \"percent\". Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "TrailingStopSX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/TrailingStopSX",
        "description": "Description The TrailingStopSX strategy generates a Short Exit signal when the High price exceeds the Trailing Stop value. This value is based on Stop Price which is equal to prior Entry price plus specified offset. The offset can be measured in percent, actual price points, or ticks (see input parameters' description for details). The Trailing Stop value lowers the Stop Price as the market price decreases; if however the market price rises, the Stop Price remains unchanged. Input Parameters Parameter Description trail stop Defines the offset value in units specified for the \"offset type\" parameter. offset type Defines units in which the price offset is measured. When it is set to \"value\", the offset will be measured in dollars. \"Tick\" will set the unit equal to ticksize. To define the offset as percentage change, select \"percent\". Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "TrendFollowingStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/TrendFollowingStrat",
        "description": "The Trend Following strategy is a moving average-based trading system. It adds simulated order of all kinds based on price action in relation to its moving average. The following conditions are used for order simulation (default percentage values may be optimized via input parameters): Long Entry. Added when the close price rises 3% above its moving average. Long Exit. Added when the close price falls 4% below the moving average. Short Entry. Added when the close price falls 3% below the moving average. Short Exit. Added when the close price rises 4% above its movving average. Note that stop-losses and profit targets can be used for performance enhancement. In this regard, consider adding StopLossLX , StopLossSX , ProfitTargetLX , and ProfitTargetSX strategies. Input Parameters length The period to be used in the calculation of the moving average. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . entry percent level The percentage value used for entry orders. exit percent level The percentage used for exit orders. Further Reading 1. \"Does Fully Automated Trading Software Work?\" by James Breen. Technical Analysis of Stocks & Commodities, November 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "UniversalOscillatorStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/UniversalOscillatorStrat",
        "description": "Description The Universal Oscillator strategy is based upon the eponymous technical indicator created by John Ehlers. This strategy analyzes the behavior of the white spectrum-based oscillator and adds simulated orders upon its crossovers with zero line. The strategy allows for two interpretations of the oscillator: trend following and reversal based. In the trend-following mode, the strategy adds a simulated Buy order when the Universal Oscillator crosses above the zero level, and a simulated Sell order when it crosses below. For the reversal mode, the signals are the opposite: Buy orders are added upon crossing below the zero level, and Sell orders upon crossing above. Input Parameters cutoff length Used in the calculation of EhlersSuperSmootherFilter ; defines the maximum period for a wave to be considered undesirable noise. mode Defines the mode of adding simulated orders: trend following or reversal. Further Reading 1. \"Whiter is Brighter\" by John Ehlers, PhD. Technical Analysis of Stocks & Commodities, January 2015. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "VHFTrend",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/VHFTrend",
        "description": "Description The VHFTrend strategy is based on the trend-following indicator Vertical Horizontal Filter (VHF) . Values of this indicator are interpreted by the strategy as follows: VHF values being greater than both a lower threshold ( crit level in the input parameters) and its own lowest value times a multiplier are read as indication of trend development; VHF values being greater than a higher threshold level ( trend level in the input parameters ) but lower than the maximum level are interpreted as strong trending conditions; If either of these conditions is true and close price rises above its own moving average, a simulated buy-to-open order is added. In the same conditions, a simulated sell-to-open order is added should the close price fall below the average. Simulated exit orders are added based on crossovers of the close price plot with its moving average: when the close price crosses below the average, a simulated sell-to-close order is added; when it crosses above - the simulation of buy-to-close takes place. Input Parameters length Defines the period for the calculation of the Vertical Horizontal Filter (VHF). lag Defines the period upon which the lowest VHF value is to be found (used in checking for trend development). average length Defines the period for the calculation of the moving average. trend level Defines the minimum VHF level at which strong trending conditions are recognized. max level Defines the maximum VHF level at which strong trending conditions are recognized. crit level Defines the minimum VHF level at which trend development is recognized. mult Defines the multiplier used in checking for trend development. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Further Reading 1. \"Which Trend Indicator Wins?\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, October 2016. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "VIX_Timing",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/VIX-Timing",
        "description": "Description The VIX Timing strategy is a forecasting tool which uses Chicago Board Options Exchange Market Volatility Index (VIX) in order to indicate buying or selling opportunities for broad-based indexes like the S&P 500 and the Dow Jones Industrial Average. The VIX is sometimes called \"the fear index\"; it represents implied volatility in the stock market for the next 30 days. According to the rules described by Trent Gardner in his article \"Using VIX To Forecast The S&P 500\", orders are added upon the following conditions: Buy order is added after the VIX has constantly been below its SMA during trend period, Sell order is added after the VIX has constantly been above its SMA during trend period. Input Parameters Parameter Description price The price used in calculation of VIX. sma length The number of bars used in calculation of SMA. trend length The number of bars in the period upon which the VIX is compared to its SMA. Further Reading 1. \"Using VIX To Forecast The S&P 500\" by Trent Gardner. Technical Analysis of Stocks & Commodities, December 2012. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "VolatilityBand",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/VolatilityBand",
        "description": "Description The Volatility Band strategy generates trading signals determined by volatility-based boundaries. Like in several other volatility band indicators, these boundaries are placed a number of deviations above and below a mean price value; for Volatility Band, this value is equal by default to simple moving average (SMA) of exponentially smoothed typical price (hlc3) . Deviations are based on the difference between typical and Low price of adjacent bars, taking into account whether the typical price is greater or less than its previous value (for more detailed information on mathematics involved, refer to Sylvain Vervoort's article \"Within the Volatility Band\" published in August 2013 issue of \"Technical Analysis of Stocks & Commodities\"). According to S. Vervoort's observations, prices tend to reach the upper band more often than the lower one; this issue is addressed by using an adjustment factor for the lower band, i.e., the multiplier that makes lower band's shift from the middle line not equal to that of the upper band. Buy signal is generated when Close price gets higher than the upper band; Sell signal when it falls below the lower band. Input Parameters Parameter Description price The price with which the middle line is calculated. average length The number of bars used to calculate the SMA. volatility length The number of bars used to calculate the third ADX for TAC_ADX. deviation factor The number of deviations determining the distance between the middle line and the upper band. low band adjust Adjustment factor for the lower band Plots Plot Description MidLine The middle line, SMA of exponentially smoothed price data. UpperBand The upper band. LowerBand The lower band. Further Reading 1. \"Within the Volatility Band\" by Sylvain Vervoort. Technical Analysis of Stocks & Commodities, August 2013. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "VolSwitch",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/VolSwitch",
        "description": "Description The VolSwitch strategy is based upon the Volatility Switch study in combination with such indicators as Relative Strength Index (RSI) and simple moving average (SMA) . If the Volatility Switch indicates a trending mode of market, a Buy signal is given when the close (or another price specified in inputs) crosses above its SMA, and a Sell signal is given when it crosses below. If the market is in mean reversion mode suggested by the study, the Buy signal is indicated when the RSI crosses above the oversold level, and, vice versa, the Sell signal is indicated when it crosses below the overbought level. Input Parameters Parameter Description price Defines price in Volatility Switch, SMA, and RSI calculations. length Defines the period used in Volatility Switch calculation. average length The number of bars used in calculation of the SMA. rsi length The number of bars used in calculation of the RSI. rsi overbought level Defines the overbought value for the RSI. rsi oversold level Defines the oversold value for the RSI. rsi average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Further Reading 1. \"The Volatility (Regime) Switch Indicator\" by Ron McEwan. Technical Analysis of Stocks & Commodities, February 2013. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "VoltyExpanCloseLX",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/VoltyExpanCloseLX",
        "description": "Description The VoltyExpanCloseLX strategy generates Long Exit signals based on the Average True Range (ATR) value: when the next bar's low price is less than the current close by the specified number of ATRs. A Long Exit signal is generated for the next bar at the level of the current close minus ATR times factor (thus emulating a stop order). However, if the next open price is less than this level, the strategy will use it instead. Input Parameters Parameter Description num at rs The factor to multiply the Average True Range by. length The number of bars to calculate the Average True Range. average type The type of moving average to be used in calculations: simple , exponential , weighted , Wilder's , or Hull . Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. All security symbols, names, and market data are shown for illustrative purposes only, and should not be considered an offer to sell or a solicitation of an offer to purchase any security, or a recommendation of any strategy."
    },
    {
        "strategy_name": "VPNStrat",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/VPNStrat",
        "description": "Description The Volume Positive Negative (VPN) strategy is based on the eponymous technical indicator . Both the strategy and the indicator have been developed by Markos Katsanos and act on possible high-volume breakouts. A simulated buy order is added when all of the following conditions are true: The calculated VPN indicator crosses above the critical value (+10 by default). 50-bar momentum of average volume is positive. The calculated RSI (relative strength index) is less than the specified max overbought level (+90 by default). The close price is above the average. A simulated sell to close order is added when both of the following conditions are true: The calculated VPN crosses below the VPN Average. The close price is less than a recent highest close minus ATR (average true range) times a specified coefficient. Input Parameters Parameter Description length The VPN indicator period. ema length The length of the exponential moving average to smooth the result with (VPN calculation). average length The length of the average used in the calculation of the VPN Average. rsi length The length to calculate RSI with (simulated buy condition). volume average length The length of the volume average (simulated buy condition). highest length The length of the period for which the highest close is found (simulated sell condition). atr length The length to calculate ATR with (simulated sell condition). factor The factor to multiply ATR by when calculating the positive/negative volume(VPN calculation). critical value The critical value of the VPN indicator (simulated buy condition). rsi max overbought level The maximum overbought value of the RSI (simulated buy condition). num atrs The coefficient to multiply ATR by (simulated sell condition). average type The type of the moving average to be used in the calculation of the VPN Average: simple , exponential , weighted , Wilder's , or Hull . Further Reading 1. \"Detecting High-Volume Breakouts\" by Markos Katsanos. Technical Analysis of Stocks & Commodities, April 2021. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    },
    {
        "strategy_name": "VWMABreakouts",
        "url": "https://toslc.thinkorswim.com/center/reference/Tech-Indicators/strategies/T-Z/VWMABreakouts",
        "description": "Description The VWMA Breakouts strategy is a moving average-based breakout indicator designed by Ken Calhoun for swing trading in volatile markets. Its main purpose is to combine the beneficial properties of a simple moving average and a volume-weighted one. As the name implies, the volume-weighted moving average (VWMA) assigns different weights to the close price when calculating the average; greater weights being assigned to close price readings that have shown higher volume. The indicator consists of two lines: an SMA of the close price, which acts as a trendline, and a VWMA line, being a signal line. When the price rises on high volume, the VWMA line is likely to be seen moving further away from the SMA, which may be regarded as a signal for uptrend continuation. Simulated trade signals are given upon crossovers of the VWMA and the SMA. When the VWMA crosses above the SMA, a buy to open signal is indicated. When it falls back below the SMA, a sell to close signal is given. By default, a 50-period VWMA and a 70-period SMA lines are calculated; these values are suggested by the author for use on 15-day 15-minute charts. These values as well as the type of the moving average to be used as the trendline can be modified in the input parameters. Input Parameters Parameter Description vwma length The length of the volume-weighted moving average. ma length The length of the moving average to be used as the trendline. average type The type of the moving average to be used as the trendline. Plots Plot Description VWMA The plot of the signal volume-weighted moving average. MA The plot of the trendline moving average. Further Reading 1. \"Volume-Weighted Moving Average Breakouts\" by Ken Calhoun. Technical Analysis of Stocks & Commodities, February 2017. Backtesting is the evaluation of a particular trading strategy using historical data. Results presented are hypothetical, and there is no guarantee that the same strategy implemented today would produce similar results. Technical analysis is not recommended as a sole means of investment research. For educational purposes only. Not a recommendation of a specific security or investment strategy."
    }
]